Connected to card in 'Yubico Yubikey 4 OTP+U2F+CCID 00 00'
Connected to virtual PCD at localhost:35963
Power Up
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02                    ..?..\._..

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 07                    ..?..\._..

Response 55 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 33 F0 15 A0 00 00 01 16 FF 02 02 13 96 24 81  S3............$.
0010:  B4 51 41 F2 11 83 34 F4 FA F1 01 21 F2 01 21 F3  .QA...4....!..!.
0020:  00 F4 01 00 F5 01 10 F6 00 F7 00 FA 00 FB 00 FC  ................
0030:  00 FD 00 FE 00 90 00                             .......

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B                    ..?..\._..

Response 256 bytes: 61 6D  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 01 67 70 82 01 5E 30 82 01 5A 30 82 01 01  S..gp..^0..Z0...
0010:  A0 03 02 01 02 02 09 00 F7 01 90 9A 8A 4E C0 52  .............N.R
0020:  30 0A 06 08 2A 86 48 CE 3D 04 03 02 30 33 31 0C  0...*.H.=...031.
0030:  30 0A 06 03 55 04 03 0C 03 62 61 72 31 0D 30 0B  0...U....bar1.0.
0040:  06 03 55 04 0B 0C 04 74 65 73 74 31 14 30 12 06  ..U....test1.0..
0050:  03 55 04 0A 0C 0B 65 78 61 6D 70 6C 65 2E 63 6F  .U....example.co
0060:  6D 30 1E 17 0D 31 37 30 35 33 31 31 30 34 38 31  m0...17053110481
0070:  31 5A 17 0D 31 38 30 35 33 31 31 30 34 38 31 31  1Z..180531104811
0080:  5A 30 33 31 0C 30 0A 06 03 55 04 03 0C 03 62 61  Z031.0...U....ba
0090:  72 31 0D 30 0B 06 03 55 04 0B 0C 04 74 65 73 74  r1.0...U....test
00a0:  31 14 30 12 06 03 55 04 0A 0C 0B 65 78 61 6D 70  1.0...U....examp
00b0:  6C 65 2E 63 6F 6D 30 59 30 13 06 07 2A 86 48 CE  le.com0Y0...*.H.
00c0:  3D 02 01 06 08 2A 86 48 CE 3D 03 01 07 03 42 00  =....*.H.=....B.
00d0:  04 F9 B3 B6 E2 85 26 53 B6 D6 E8 A1 2B 3B EF EC  ......&S....+;..
00e0:  B5 6D CB 60 46 1C 7F 28 78 5E D3 39 EA FF D6 FE  .m.`F..(x^.9....
00f0:  0E 39 40 3D AB 61 B8 1A 76 03 3A 71 C1 37 61 6D  .9@=.a..v.:q.7am

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 111 bytes: 90 00  [I] Command successfully executed (OK).
0000:  09 CD D3 94 80 E4 3E 13 73 6E 42 27 D3 98 BE E4  ......>.snB'....
0010:  1D C6 DD 30 0A 06 08 2A 86 48 CE 3D 04 03 02 03  ...0...*.H.=....
0020:  47 00 30 44 02 20 42 79 8B ED 03 58 4D 04 E3 F1  G.0D. By...XM...
0030:  5B 7F 88 A3 CD EA 29 D4 3C 73 E2 0A 1A 00 4F 81  [.....).<s....O.
0040:  1F 09 6A 13 4A 09 02 20 14 5A 3B 2C 4E E5 EA 15  ..j.J.. .Z;,N...
0050:  77 72 35 B0 67 E6 49 D8 43 04 C4 95 26 BA 08 71  wr5.g.I.C...&..q
0060:  A0 E0 93 F6 C8 FA FB 90 71 01 00 FE 00 90 00     ........q......

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0D                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0E                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0F                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 10                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 11                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 12                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 13                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 14                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 15                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 16                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 17                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 18                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 19                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1A                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1B                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1C                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1D                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1E                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1F                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 20                    ..?..\._. 

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 00                                   . ...

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 D1 74 66 FD C9 07 6F B8 90 00        |....tf...o...

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 B2 4F AA A1 B9 95 EB  .....|....O.....
0010:  22 81 08 25 B4 5E 3E 1A 69 67 ED                 "..%.^>.ig.

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 D0 0A 28 16 CA C5 8B 9D 90 00        |.....(.......

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9A 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 96 4A DF AA FA 79 AB  .I........J...y.
0010:  EB 1D 3D 76 DA 87 A1 D9 26 65 B6 32 4B 1C 69 15  ..=v....&e.2K.i.
0020:  3E 7C E3 13 BA 94 05 47 A2 D1 47 9A EC 07 ED ED  >|.....G..G.....
0030:  AE 78 6B E7 BE C9 E4 D2 A4 5B 9F 6D 7A 58 50 F2  .xk......[.mzXP.
0040:  6D EC 5E 84 73 4C 86 87 F4 92 CB AA FC C4 47 A1  m.^.sL........G.
0050:  31 3A B4 78 F5 B1 C4 AC 5F AC DE EE 63 C4 2B 00  1:.x...._...c.+.
0060:  98 D0 36 F4 D2 9D 39 11 B9 77 D8 77 96 01 01 54  ..6...9..w.w...T
0070:  62 5B 42 69 FD A9 DC 0F C7 0C CE D8 0E 23 93 B2  b[Bi.........#..
0080:  24 FD FA 8D F7 2B 39 0C 54 E3 F5 36 E5 8A D4 28  $....+9.T..6...(
0090:  6A 9D A0 86 63 5B 2A 0F 91 E4 26 5F 8F B2 3B A4  j...c[*...&_..;.
00a0:  4C 25 53 08 E8 BC 2F 63 15 42 49 9F 16 ED 24 01  L%S.../c.BI...$.
00b0:  5A 26 64 50 55 E9 FD ED A0 11 78 D6 23 0C 78 89  Z&dPU.....x.#.x.
00c0:  E6 B8 CB F8 A9 8D C9 98 86 49 C8 DF 6C D5 B1 ED  .........I..l...
00d0:  94 99 E0 AF E0 74 06 24 B2 A5 2C E5 45 61 64 72  .....t.$..,.Eadr
00e0:  41 B9 7F 34 9B 1A 67 44 4C C7 B0 DD E9 78 26 0D  A..4..gDL....x&.
00f0:  AD AA 72 E6 74 E5 9C 8A 0B 77 17 1A E2 14 61 10  ..r.t....w....a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  C9 77 91 89 8B DF 17 28 19 29 D5 82 03 01 00 01  .w.....(.)......
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 AB 21 79 CF 0B DF E8 78 90 00        |....!y....x..

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 D3 8A 2F 19 E0 F5 57  .....|...../...W
0010:  E1 81 08 3C 6C A3 7C 09 F7 69 12                 ...<l.|..i.

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 F9 A6 F7 EC 3F 65 BE C0 90 00        |.......?e....

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9A 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 96 90 FA BE C6 BC 19  .I..............
0010:  05 CE 35 B5 1F 55 47 0B EE 7D 09 5D 3F 90 F4 57  ..5..UG..}.]?..W
0020:  A6 14 23 59 26 29 A9 66 C5 6B F6 D9 91 43 03 8E  ..#Y&).f.k...C..
0030:  4B 1B D5 B5 BA 72 66 D2 0F 49 A0 8C FB 99 C1 FB  K....rf..I......
0040:  4E 32 75 3B 49 E1 E7 6A E8 C8 71 B3 0F 7F 28 88  N2u;I..j..q...(.
0050:  B9 F4 29 5A B4 BC 1E 7D 24 72 F9 FC 2D CD 3F FC  ..)Z...}$r..-.?.
0060:  19 F0 9D B6 B3 BC 2F 5D 7D D0 8E F4 5D 81 3A 27  ....../]}...].:'
0070:  0E 65 97 45 8B E8 F4 5A C0 E7 E4 FA D1 45 E0 51  .e.E...Z.....E.Q
0080:  63 13 F8 70 B8 03 2A A0 2C E4 84 A1 E1 54 17 52  c..p..*.,....T.R
0090:  66 74 E6 A9 5B 62 E1 CF 99 B7 63 1B DB 96 15 53  ft..[b....c....S
00a0:  FC 2E 13 1B 0F 9F EE C5 B7 B8 F9 F4 37 21 93 D9  ............7!..
00b0:  55 02 C2 99 E2 CD A1 5C 12 DB F0 83 F2 B6 A9 EA  U......\........
00c0:  EB EC 16 7D 56 59 20 D0 0C 9C A0 63 91 63 8B 6C  ...}VY ....c.c.l
00d0:  42 E0 F1 6C 49 76 59 5A AE 3D 18 3F 28 B9 86 D7  B..lIvYZ.=.?(...
00e0:  6B 1C 4B 29 4A AA 3B 31 47 90 FD 73 A2 F8 55 DA  k.K)J.;1G..s..U.
00f0:  15 DF 25 E6 32 BF 14 60 E1 DC 0C B5 94 58 61 10  ..%.2..`.....Xa.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  60 AA C9 57 62 BC FC 2B 12 FC 33 82 03 01 00 01  `..Wb..+..3.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 49 EB C9 95 85 4D 98 FC 90 00        |...I....M....

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 84 5D 9F 4F F0 BB 23  .....|....].O..#
0010:  B3 81 08 D2 C4 5C E3 98 AA 3F 5E                 .....\...?^

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 D2 4D DC 3E 4D A0 69 C4 90 00        |....M.>M.i...

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9A 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 93 3D 74 62 27 74 44  .I........=tb'tD
0010:  21 AC 14 14 FF 5A 0D 4B 86 E7 27 1B 4E 4F 03 30  !....Z.K..'.NO.0
0020:  B2 F7 40 F5 FA 52 60 3D CA 2F 76 BC 55 4D DA 14  ..@..R`=./v.UM..
0030:  94 DB A1 E0 D4 AB 7F FE CA D2 ED EB 77 0C BA 64  ............w..d
0040:  5B 67 B5 C1 50 B6 6F B0 B9 E8 61 50 89 24 CD 4C  [g..P.o...aP.$.L
0050:  15 3D 91 01 3B D5 65 47 70 97 60 43 24 BC FD AB  .=..;.eGp.`C$...
0060:  A6 90 2B 5A DE F6 86 FD D6 93 BE 15 58 E9 44 3E  ..+Z........X.D>
0070:  FA 01 6C CD 10 76 E4 D6 D0 86 23 45 5C 32 D3 4E  ..l..v....#E\2.N
0080:  ED 03 20 A4 89 20 04 D2 5C F3 36 5B 6E 26 C5 30  .. .. ..\.6[n&.0
0090:  82 1A ED 63 B3 B6 8D 7F 23 AB C9 DF 89 4F 61 C3  ...c....#....Oa.
00a0:  D2 2B 9F 57 EE 49 9F 07 BB 47 2B AF 5B F7 CF 0D  .+.W.I...G+.[...
00b0:  26 EB 95 43 51 A2 B0 D5 DC D9 9B 67 38 43 1E 0C  &..CQ......g8C..
00c0:  2B A1 2A 58 53 7B 52 12 A7 11 8C 2A 19 78 C9 74  +.*XS{R....*.x.t
00d0:  46 79 15 DC B7 8C 1F 08 24 92 B8 84 89 6E 58 0B  Fy......$....nX.
00e0:  C4 06 02 D8 02 36 E7 BF D9 91 D5 C1 BC 25 09 C8  .....6.......%..
00f0:  28 5A 49 63 22 A0 D4 30 62 55 55 DE 76 C9 61 10  (ZIc"..0bUU.v.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  A6 45 FF B6 DC D3 F2 95 D1 81 7D 82 03 01 00 01  .E........}.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 40 67 C6 FF 28 9F 55 CA 90 00        |...@g..(.U...

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 AC 92 1D AF C9 1A 4D  .....|.........M
0010:  0B 81 08 26 59 67 E4 30 94 F7 F6                 ...&Yg.0...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 80 F9 94 44 53 09 0C 79 90 00        |......DS..y..

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9A 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 96 82 C2 C8 B5 B0 5E  .I.............^
0010:  57 A1 29 EF F5 D2 72 56 A2 E1 12 FE E2 17 CD BA  W.)...rV........
0020:  C3 C0 C1 06 1B 8D 6D 6A 00 F8 E3 51 93 5E AC D1  ......mj...Q.^..
0030:  32 49 94 BE C9 DB 94 15 85 FB 89 C8 5D 97 42 82  2I..........].B.
0040:  79 28 98 DC 56 B5 EA BB 9A 1A 05 A8 FF 36 C3 DD  y(..V........6..
0050:  50 42 F6 8A 9C 10 EC CF A4 61 31 A6 0B BF D9 C2  PB.......a1.....
0060:  BC 3E DE 09 7A 23 DB AB 8A 35 B5 B1 76 E0 64 6F  .>..z#...5..v.do
0070:  63 A2 C0 39 D5 BF 67 67 EB 08 15 42 15 3E DF AE  c..9..gg...B.>..
0080:  CD 34 8C 4D 2B F8 2E 3E AB 8B EA B1 CE 49 64 27  .4.M+..>.....Id'
0090:  5A 5A A4 AC 8F 0B 4D 71 BB BF 2C 69 F6 33 83 D2  ZZ....Mq..,i.3..
00a0:  24 21 D4 AF FC 10 DE A2 3A EF B7 5F 14 82 FB 6F  $!......:.._...o
00b0:  5F FB 05 46 03 DB 84 7C CF BC 3D 88 EF 29 33 B7  _..F...|..=..)3.
00c0:  4F 68 1D D0 2B BF 47 AE 51 7F B8 71 D2 A9 AB DC  Oh..+.G.Q..q....
00d0:  0E F8 93 9C 5A EB 88 4D 59 12 8F 75 CB 27 B7 A1  ....Z..MY..u.'..
00e0:  2A D1 84 81 4F 62 DD 1E E5 81 8D 6B DD 03 80 8F  *...Ob.....k....
00f0:  C8 F5 73 F3 E2 53 C3 62 60 27 82 3E 73 47 61 10  ..s..S.b`'.>sGa.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  57 FB A9 56 CA 5C D2 43 C6 95 BD 82 03 01 00 01  W..V.\.C........
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 BA CE B2 3C 3E 5E D3 72 90 00        |......<>^.r..

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 D6 E5 45 9F C9 3F A7  .....|.....E..?.
0010:  AC 81 08 F2 B3 85 A4 D1 BB 97 56                 ..........V

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 FE BB 7A 88 19 72 6A BD 90 00        |.....z..rj...

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9A 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 98 4B 8E 01 64 81 6A  .I........K..d.j
0010:  AD E9 2F C4 B1 81 25 99 0A D8 23 76 B2 79 50 08  ../...%...#v.yP.
0020:  CF FD D3 9F E9 F9 63 86 EB 1E E0 39 30 C5 49 15  ......c....90.I.
0030:  57 4E 99 B4 51 19 7B C5 82 9F 70 E3 87 BF 66 A5  WN..Q.{...p...f.
0040:  F8 B5 1C 83 64 BF DA 7C BF 7B FA 7F 29 89 07 60  ....d..|.{..)..`
0050:  CB 55 5A 01 B2 A1 54 0C BD 56 F4 3E 21 62 96 7E  .UZ...T..V.>!b.~
0060:  12 D4 66 9A 67 C8 73 B5 67 D3 85 9E 8D 12 72 29  ..f.g.s.g.....r)
0070:  5E 70 76 2D 8E F6 E7 20 4C CD FB CA 1B 8E 1C 04  ^pv-... L.......
0080:  00 8D DC 28 E9 73 FD B3 FF F8 23 A3 BA 26 CE 81  ...(.s....#..&..
0090:  08 71 69 2E 75 69 42 61 42 99 C3 74 75 E5 08 53  .qi.uiBaB..tu..S
00a0:  21 A9 32 83 0E 1F A6 7B 9E E5 FF 7A 7D 3E A1 2C  !.2....{...z}>.,
00b0:  45 02 C9 02 2A D3 E7 07 63 E8 33 DE 96 8B 50 15  E...*...c.3...P.
00c0:  27 2E AB 6C A0 F2 D2 C1 E4 8B 2A 63 1D 96 BA 1D  '..l......*c....
00d0:  39 68 A2 2F 1B 89 E7 41 86 28 09 C1 D7 54 6A 42  9h./...A.(...TjB
00e0:  B8 CF 90 2B 57 DD 98 23 95 F5 91 CB F6 E8 3B 6A  ...+W..#......;j
00f0:  12 60 2E 02 5B 9A C7 06 9F 5B ED E9 4C A2 61 10  .`..[....[..L.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  55 59 05 20 36 7E 95 13 A8 7C 99 82 03 01 00 01  UY. 6~...|......
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 6B F8 46 1F D0 A0 76 E5 90 00        |...k.F...v...

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 CA 95 20 3F 5D 14 94  .....|..... ?]..
0010:  2F 81 08 2E 62 64 04 2E 10 87 2D                 /...bd....-

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 46 E6 F0 70 1F B1 8F 46 90 00        |...F..p...F..

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 EA 38 29 C6 D2 7F 90  .....|....8)....
0010:  8F 81 08 B2 2A 4C 95 4D 6D 12 BD                 ....*L.Mm..

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 CC C0 0E 8D 7A BB 0F E1 90 00        |.......z.....

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9A 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 9D 50 28 A6 61 B4 55  .I........P(.a.U
0010:  60 85 68 5E F4 57 51 5E A6 25 68 8F A3 C8 89 4D  `.h^.WQ^.%h....M
0020:  83 52 E0 8F DD 7F 06 0C 8D 49 6E 45 B3 54 FC FF  .R.......InE.T..
0030:  C6 15 AC F8 AA 71 5A CE AD F3 7E BA 05 E2 55 99  .....qZ...~...U.
0040:  66 EF 46 7D D4 C4 C5 31 46 A8 B7 3E 9B F7 72 E9  f.F}...1F..>..r.
0050:  71 57 F9 6C C9 32 93 4A AA 19 C0 E8 0D D6 78 86  qW.l.2.J......x.
0060:  3F AF 11 04 F9 28 19 D1 41 EA 2F 47 57 53 76 1E  ?....(..A./GWSv.
0070:  DC 98 39 B9 3C 1A 39 DB E2 2C E6 27 BC 12 E6 D9  ..9.<.9..,.'....
0080:  16 71 27 59 D8 6E E1 DF 71 B8 0D 22 0C AF A8 05  .q'Y.n..q.."....
0090:  8F 58 94 1F 26 D4 93 2A EB 34 DB DA CE 44 5A C7  .X..&..*.4...DZ.
00a0:  88 80 66 33 70 17 E5 82 61 1D BB F5 55 9A 94 D5  ..f3p...a...U...
00b0:  EB 58 DF D5 E1 36 51 ED 7C C0 BE E7 C5 9A 8D 97  .X...6Q.|.......
00c0:  17 51 01 3C 9A 6F 65 A5 57 F6 BA C4 27 52 C5 48  .Q.<.oe.W...'R.H
00d0:  B6 67 D2 D5 80 AE 33 E7 89 A7 D7 F4 E5 55 34 E9  .g....3......U4.
00e0:  88 8E 34 EA 4E E0 D6 C3 A9 A2 EA B5 07 4A 7A FF  ..4.N........Jz.
00f0:  0C 8C 4D D5 E8 CA 3F E7 09 7A A0 14 44 47 61 10  ..M...?..z..DGa.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  3E 68 B3 C5 6B 3F 9F FB E4 CB 7F 82 03 01 00 01  >h..k?..........
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 AE 14 F1 D3 DB 45 B4 D4 90 00        |........E....

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 2D 37 8A 56 BD CB 7F  .....|...-7.V...
0010:  32 81 08 9C BA DF EE B7 D6 29 99                 2........).

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 80 07 D8 CB 92 76 F0 31 90 00        |........v.1..

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9A 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 98 45 4D 20 51 B5 3D  .I........EM Q.=
0010:  D5 5B 3C 77 8F 5F DC 76 06 D2 95 EC 31 B5 F1 C5  .[<w._.v....1...
0020:  D3 39 E9 1B AE A1 B9 C3 9C 6C 45 BB 2A 18 3A F2  .9.......lE.*.:.
0030:  C6 B8 2D 49 0E 9C 37 5E 03 DA 84 0A 40 8D A2 42  ..-I..7^....@..B
0040:  C3 88 A1 61 82 F5 5B 89 42 A4 47 B8 E2 C2 23 50  ...a..[.B.G...#P
0050:  42 72 9C 60 70 A7 94 9B 4F D5 9B 34 6F 56 9E B4  Br.`p...O..4oV..
0060:  A1 B8 70 0E 68 6E D5 38 90 6D 74 78 34 81 94 7B  ..p.hn.8.mtx4..{
0070:  61 0D 6D 10 2A 8B 83 F9 EF 7A DD 56 A2 9B DC B0  a.m.*....z.V....
0080:  B8 C3 69 26 C7 CC 18 38 C3 22 7A 92 52 35 C6 18  ..i&...8."z.R5..
0090:  4B 0E 75 04 36 E0 B9 8E 3A 42 62 3D B9 7A 7D CD  K.u.6...:Bb=.z}.
00a0:  E3 DF C9 2F DE 41 1E EA 24 70 76 5A 87 C6 C4 38  .../.A..$pvZ...8
00b0:  57 93 B8 CF A8 E0 1B CB 70 C1 38 14 41 F1 96 08  W.......p.8.A...
00c0:  A5 FD A9 06 09 00 20 6B 9A 3F F9 14 69 97 B3 25  ...... k.?..i..%
00d0:  14 1B F8 F1 DE 0D EA 7D 5E 0B C4 20 DB 5F 9E 38  .......}^.. ._.8
00e0:  90 D4 43 01 37 47 98 27 95 33 FA 03 BC 52 CC BD  ..C.7G.'.3...R..
00f0:  3D 5D 3B 3C AA 26 B5 2C AF 76 BF E4 46 3D 61 10  =];<.&.,.v..F=a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D2 BB E3 13 39 DB 01 95 9A A3 CF 82 03 01 00 01  ....9...........
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02                    ..?..\._..

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 07                    ..?..\._..

Response 55 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 33 F0 15 A0 00 00 01 16 FF 02 02 13 96 24 81  S3............$.
0010:  B4 51 41 F2 11 83 34 F4 FA F1 01 21 F2 01 21 F3  .QA...4....!..!.
0020:  00 F4 01 00 F5 01 10 F6 00 F7 00 FA 00 FB 00 FC  ................
0030:  00 FD 00 FE 00 90 00                             .......

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05                    ..?..\._..

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 256 bytes: 61 C2  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 61 C2  ..kS......M..Ja.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 196 bytes: 90 00  [I] Command successfully executed (OK).
0000:  5F E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5  _.A.:..!....1...
0010:  B8 A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11  ...J.....0....u.
0020:  EC 1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61  ........TCqP.K.a
0030:  15 AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E  ..........[,.%.N
0040:  65 FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0  e.c.K..ei..4+*..
0050:  F2 EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A  ...X....p.k?x..J
0060:  02 A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B  .....=....1.d..{
0070:  C1 30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37  .0q.].F...k....7
0080:  BC 9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76  ......V.v.7Z..Vv
0090:  F3 1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7  ../.....o/6."...
00a0:  7C 7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75  |...\......}...u
00b0:  7A 6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00  zn.&......'..q..
00c0:  FE 00 90 00                                      ....

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B                    ..?..\._..

Response 256 bytes: 61 6D  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 01 67 70 82 01 5E 30 82 01 5A 30 82 01 01  S..gp..^0..Z0...
0010:  A0 03 02 01 02 02 09 00 F7 01 90 9A 8A 4E C0 52  .............N.R
0020:  30 0A 06 08 2A 86 48 CE 3D 04 03 02 30 33 31 0C  0...*.H.=...031.
0030:  30 0A 06 03 55 04 03 0C 03 62 61 72 31 0D 30 0B  0...U....bar1.0.
0040:  06 03 55 04 0B 0C 04 74 65 73 74 31 14 30 12 06  ..U....test1.0..
0050:  03 55 04 0A 0C 0B 65 78 61 6D 70 6C 65 2E 63 6F  .U....example.co
0060:  6D 30 1E 17 0D 31 37 30 35 33 31 31 30 34 38 31  m0...17053110481
0070:  31 5A 17 0D 31 38 30 35 33 31 31 30 34 38 31 31  1Z..180531104811
0080:  5A 30 33 31 0C 30 0A 06 03 55 04 03 0C 03 62 61  Z031.0...U....ba
0090:  72 31 0D 30 0B 06 03 55 04 0B 0C 04 74 65 73 74  r1.0...U....test
00a0:  31 14 30 12 06 03 55 04 0A 0C 0B 65 78 61 6D 70  1.0...U....examp
00b0:  6C 65 2E 63 6F 6D 30 59 30 13 06 07 2A 86 48 CE  le.com0Y0...*.H.
00c0:  3D 02 01 06 08 2A 86 48 CE 3D 03 01 07 03 42 00  =....*.H.=....B.
00d0:  04 F9 B3 B6 E2 85 26 53 B6 D6 E8 A1 2B 3B EF EC  ......&S....+;..
00e0:  B5 6D CB 60 46 1C 7F 28 78 5E D3 39 EA FF D6 FE  .m.`F..(x^.9....
00f0:  0E 39 40 3D AB 61 B8 1A 76 03 3A 71 C1 37 61 6D  .9@=.a..v.:q.7am

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 111 bytes: 90 00  [I] Command successfully executed (OK).
0000:  09 CD D3 94 80 E4 3E 13 73 6E 42 27 D3 98 BE E4  ......>.snB'....
0010:  1D C6 DD 30 0A 06 08 2A 86 48 CE 3D 04 03 02 03  ...0...*.H.=....
0020:  47 00 30 44 02 20 42 79 8B ED 03 58 4D 04 E3 F1  G.0D. By...XM...
0030:  5B 7F 88 A3 CD EA 29 D4 3C 73 E2 0A 1A 00 4F 81  [.....).<s....O.
0040:  1F 09 6A 13 4A 09 02 20 14 5A 3B 2C 4E E5 EA 15  ..j.J.. .Z;,N...
0050:  77 72 35 B0 67 E6 49 D8 43 04 C4 95 26 BA 08 71  wr5.g.I.C...&..q
0060:  A0 E0 93 F6 C8 FA FB 90 71 01 00 FE 00 90 00     ........q......

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0D                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0E                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0F                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 10                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 11                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 12                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 13                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 14                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 15                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 16                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 17                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 18                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 19                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1A                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1B                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1C                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1D                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1E                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 1F                    ..?..\._..

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  10 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 20                    ..?..\._. 

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 00                                   . ...

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 87  .....|..........
0010:  D3 78 F0 7D CB C5 F7 5C CD 6D 40 E8 A1 83 C6 46  .x.}...\.m@....F
0020:  01 09 A2 19 AB 0D 79 38 82 5A 80 36 3D B4 ED B6  ......y8.Z.6=...
0030:  DC 75 73 8B A2 60 5A 0B 0F 48 80 E0 59 4F AA 9E  .us..`Z..H..YO..
0040:  D5 3D 0B 4F FC 32 14 61 FC 57 2B 80 9B A2 3B 2A  .=.O.2.a.W+...;*
0050:  95 45 57 96 81 99 AD 9E A3 0A 9D 44 48 86 11 EC  .EW........DH...
0060:  95 1B 3E 6F 4E AF F5 00 EE 04 0F 75 6C 1B DA A0  ..>oN......ul...
0070:  7E E1 63 9C BA 63 F3 54 46 AE 85 8B 37 2E 11 3D  ~.c..c.TF...7..=
0080:  BC 85 59 83 8E D9 99 F5 8D 13 F2 64 A1 46 62 40  ..Y........d.Fb@
0090:  9E 59 37 A1 17 B9 88 CE A3 E5 91 AF BC B6 2E 87  .Y7.............
00a0:  3C 7A 78 9B C9 AB 20 43 62 09 ED 26 A5 21 92 8F  <zx... Cb..&.!..
00b0:  29 E6 B0 34 CF 72 62 DC C6 A3 62 1F 2E BF 75 FF  )..4.rb...b...u.
00c0:  5B 80 ED D5 CC F1 1C 0A C4 FE 0D DB 5B 01 7C 84  [...........[.|.
00d0:  2C 1C FB 94 DF B4 E6 0F 96 73 AB 44 1E F3 D5 FA  ,........s.D....
00e0:  45 FE DE A0 54 C2 F1 7D 53 09 AB F4 EE 36 2C 4B  E...T..}S....6,K
00f0:  9A E6 F3 D4 F6 FE D6 F7 00 25 2F 9B F0 4D B6 7F  .........%/..M..
0100:  CF DF FB 72                                      ...r

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 32 88 F6 5F 93 85 D9 06 E1 65 D0  .....2.._.....e.

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 4E  .....|.........N
0010:  D2 77 DD 64 AA 8F 22 2F 91 18 9F F0 C8 62 3D 31  .w.d.."/.....b=1
0020:  F2 35 2D 02 39 42 C2 C0 87 D1 7F 6C F2 C6 F8 BD  .5-.9B.....l....
0030:  8D C5 7A B2 53 00 A6 BC 74 BE E3 8A 7C 1D 7D 09  ..z.S...t...|.}.
0040:  C4 7E 11 75 F8 2D 20 FC 88 47 E6 88 A0 82 FD 62  .~.u.- ..G.....b
0050:  6D 08 33 06 24 9F AF E8 28 74 CF C6 C6 79 BC 94  m.3.$...(t...y..
0060:  1E C7 79 B8 2D C8 F5 7E 70 9B 2D 0D 6C 0A 29 05  ..y.-..~p.-.l.).
0070:  BF 25 80 8D 6D 71 B6 70 6E 4F E1 16 DA 9E E1 E1  .%..mq.pnO......
0080:  4D EB 31 11 99 C1 DB A7 48 40 6E AE 16 11 AA 28  M.1.....H@n....(
0090:  99 C5 59 05 F2 E9 0D 8B 2B 51 55 4A 78 5F A9 A5  ..Y.....+QUJx_..
00a0:  47 3F 7B 07 3B C2 D4 27 0D A7 36 17 A3 16 53 AA  G?{.;..'..6...S.
00b0:  80 45 69 B8 FD 51 99 E6 BF 90 42 AF 0C BD D5 A5  .Ei..Q....B.....
00c0:  CD A4 B4 B5 A7 C8 72 C3 94 FB A5 70 91 83 5A 5E  ......r....p..Z^
00d0:  A5 57 7E 2F 8C 81 BE 3A BF 9C 2F 0A 20 47 5A E2  .W~/...:../. GZ.
00e0:  01 BB EB 11 AC 10 65 88 2D FE 92 60 35 62 94 A8  ......e.-..`5b..
00f0:  41 FF FE 92 12 C7 56 79 95 16 6E 43 E7 CA 02 0E  A.....Vy..nC....
0100:  ED 16 52 39                                      ..R9

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 0E 7A C8 20 77 4B 68 F0 4B D7 1B  ......z. wKh.K..

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 4F  .....|.........O
0010:  6C 8A 62 3D 0F 3D 3D 59 AF 39 4D C9 94 72 EA 4B  l.b=.==Y.9M..r.K
0020:  ED 9D 01 FD 89 4D 94 13 9F 76 77 62 2F 68 D4 50  .....M...vwb/h.P
0030:  48 A6 73 68 29 01 53 E9 F8 B4 6E 61 71 0F 06 A1  H.sh).S...naq...
0040:  8F AA 9A BE F5 FA A5 E6 E8 C6 B9 7C EF 2E AF DF  ...........|....
0050:  AD 30 25 F1 28 37 D4 05 CF 6C E3 7D 8B 48 81 A4  .0%.(7...l.}.H..
0060:  FF 23 43 18 18 11 1D 4F BF A6 A6 E2 02 00 93 92  .#C....O........
0070:  C2 D0 FE BD 40 FA F3 AA EF 50 97 C8 6D AE F0 49  ....@....P..m..I
0080:  E8 9E B2 F4 87 20 09 32 6D 6B C0 6D 08 DD 82 73  ..... .2mk.m...s
0090:  12 68 76 A2 BC F7 52 BD 97 DB 18 79 17 51 FB 04  .hv...R....y.Q..
00a0:  1B 7B 3E A9 C4 CC 33 DC 4C A3 72 8D 38 6A AA E3  .{>...3.L.r.8j..
00b0:  86 C9 E9 13 59 6E 23 73 4F 1F 53 12 C5 15 D8 08  ....Yn#sO.S.....
00c0:  F6 7A F5 26 9B 69 09 BA 12 7B EA BA 1A DF 4B BC  .z.&.i...{....K.
00d0:  E8 18 30 13 10 1B 7F B3 C6 6F FB 4C C1 4A 1A 5B  ..0......o.L.J.[
00e0:  33 7E 8C 90 32 CC 46 78 A0 43 C3 EF 56 29 50 78  3~..2.Fx.C..V)Px
00f0:  1E 1C 76 60 E7 31 91 F0 35 4F AE 17 71 32 67 4C  ..v`.1..5O..q2gL
0100:  6A 1A FC 5B                                      j..[

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B CA AE FC F4 C6 7B C1 A9 A9 87 50  ..........{....P

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 05  .....|..........
0010:  9A B3 50 02 6F 25 21 1B 3D C8 94 9D 19 D2 64 67  ..P.o%!.=.....dg
0020:  3F 16 09 F0 D4 E0 FE 73 37 A1 9D 93 C6 35 5F A2  ?......s7....5_.
0030:  46 42 BA E9 1B 1D 1F 65 36 40 92 BE 87 B9 2E 3E  FB.....e6@.....>
0040:  2B 22 CA 4E 6F E0 4F FF C5 49 A5 2E 43 06 88 BA  +".No.O..I..C...
0050:  BF 1F E0 06 3F 2A 2E A1 E0 0B ED 54 92 D3 C5 93  ....?*.....T....
0060:  01 73 19 0C 2B 66 DD 59 D4 7A E6 99 1E 88 4E 65  .s..+f.Y.z....Ne
0070:  D2 DC 62 72 4C E6 CF C7 A7 96 74 AC 41 2E 2C FC  ..brL.....t.A.,.
0080:  20 6E 6D D3 3E B4 BC 8A 33 AA 7E EA 21 C8 5D 5F   nm.>...3.~.!.]_
0090:  8A 18 65 A5 18 87 20 AD 2C 42 5F 12 C2 12 8D EC  ..e... .,B_.....
00a0:  2F 7F EE F3 E6 A2 11 7D 67 28 42 4C 9E D2 8F C8  /......}g(BL....
00b0:  33 87 F4 00 DD 97 46 0F D4 F5 A7 1E D3 6A B4 3E  3.....F......j.>
00c0:  6E 6B 89 E8 CE 24 41 11 F9 F7 4E 14 8D A1 4F 0D  nk...$A...N...O.
00d0:  26 AA DC 80 E1 12 08 4B B9 F9 8E CB 54 24 5F 53  &......K....T$_S
00e0:  CA 0E 9E 18 57 8F 7C 47 88 B7 3C 05 58 47 A9 3D  ....W.|G..<.XG.=
00f0:  EC 42 23 81 38 57 3E AB 25 E5 FB E7 F6 52 3B A0  .B#.8W>.%....R;.
0100:  28 B6 0C 88                                      (...

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 54 C0 41 95 D6 DA 68 C4 CE 24 75  .....T.A...h..$u

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 66  .....|.........f
0010:  39 C5 07 4F 73 57 FB C7 79 71 8C 49 59 2C 34 2D  9..OsW..yq.IY,4-
0020:  9A E8 E0 40 F2 C7 1D 56 9A D0 3B B3 9C FE 9A 51  ...@...V..;....Q
0030:  47 4A 5A 0E 8A 0B 83 87 52 4D D9 39 FC 21 28 30  GJZ.....RM.9.!(0
0040:  B0 73 8C 75 9C B0 AA D0 EC AD 20 7F D0 70 20 6E  .s.u...... ..p n
0050:  F3 71 67 C8 D4 E5 00 67 9B 97 4D 6A 0A E1 A8 B2  .qg....g..Mj....
0060:  B0 D4 40 BB 05 04 3B DB 57 96 DF 5E 8D AB CB BF  ..@...;.W..^....
0070:  63 D9 F9 0A CF 82 F3 D2 D4 9D C9 6F F8 F0 40 A2  c..........o..@.
0080:  78 3D C1 63 A4 15 5F 5C C1 51 0F 05 21 D0 60 CA  x=.c.._\.Q..!.`.
0090:  1F 90 F1 F2 66 02 44 14 88 FE AA 96 14 FC 7D 8B  ....f.D.......}.
00a0:  F2 51 49 2A 1E 02 6B 26 CC AC 6E 5F CE 27 62 83  .QI*..k&..n_.'b.
00b0:  ED 87 8A 22 58 73 62 7C 49 A3 12 B9 CC 65 D8 BE  ..."Xsb|I....e..
00c0:  F0 E4 B0 27 03 7D 51 3B 73 25 26 D2 6A ED 33 4D  ...'.}Q;s%&.j.3M
00d0:  7A A7 49 CC 8B 30 45 AE 2C EE 09 A2 38 8D 04 6E  z.I..0E.,...8..n
00e0:  02 6E 53 82 72 7D 40 43 2C 2A E0 1F D4 18 09 4C  .nS.r}@C,*.....L
00f0:  FC 39 9A 2A F3 A3 32 D4 5B C2 0C F7 F0 74 C4 6D  .9.*..2.[....t.m
0100:  1D ED DA ED                                      ....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B AC F0 47 23 4C DF FD BA 03 93 3B  .......G#L.....;

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 94  .....|..........
0010:  DE 6D A9 59 70 E8 CE 08 4A 52 29 3C 01 22 9C 49  .m.Yp...JR)<.".I
0020:  18 EA 12 78 92 EB 5F 0E 2A BD 21 BB D1 68 74 A2  ...x.._.*.!..ht.
0030:  0D E4 BD C0 16 07 0C 6E A2 F0 1B F2 5E 9C 5C 51  .......n....^.\Q
0040:  E1 69 37 4E 15 AE 5A 6C 87 A3 5F F2 38 44 94 33  .i7N..Zl.._.8D.3
0050:  AF DE 25 DA 5C 1A 25 58 1B 6A 44 8D 75 CF A6 6C  ..%.\.%X.jD.u..l
0060:  3D F7 70 F7 44 03 AF FE B8 80 53 CD 6A 07 18 3F  =.p.D.....S.j..?
0070:  C8 A1 1A 69 5A 34 FD 7E D6 E9 30 07 49 46 26 D6  ...iZ4.~..0.IF&.
0080:  44 28 2C 81 F1 BD 39 44 1C 7F 8A C1 B5 19 7B AB  D(,...9D......{.
0090:  E8 0E 82 6F 77 87 EA C2 EE AD 77 8A 3A F9 A6 20  ...ow.....w.:.. 
00a0:  7C F9 20 5A A6 66 17 69 42 9E 41 79 89 2A 3B 46  |. Z.f.iB.Ay.*;F
00b0:  3B 6D 28 D7 9C 29 A9 D1 D1 81 8A F6 0F 2F C8 69  ;m(..)......./.i
00c0:  78 05 46 11 B3 39 38 2C DB E8 37 48 9E CC F1 99  x.F..98,..7H....
00d0:  76 15 4C B6 A1 B6 47 3B EE AE 6C 89 EC E2 7C 65  v.L...G;..l...|e
00e0:  78 62 C8 5B BD 56 91 A6 B1 D1 6E 7E FF F7 EB 81  xb.[.V....n~....
00f0:  1D 5B 28 7D EC 34 89 28 9D F3 93 65 39 DC DA 46  .[(}.4.(...e9..F
0100:  28 39 58 57                                      (9XW

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 5F 7B 3C A7 81 AA 29 0E DD FA 80  ....._{<...)....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 70  .....|.........p
0010:  E3 61 EE C0 77 42 63 DC 8A 0B AF 59 6E D7 4E EF  .a..wBc....Yn.N.
0020:  BA 92 15 36 01 55 75 6F E0 45 00 D1 A8 62 EC EA  ...6.Uuo.E...b..
0030:  B5 11 CF 92 4E A6 D4 0D 5A 8B B9 26 55 63 1B C0  ....N...Z..&Uc..
0040:  98 CC 8E 24 BA DB 31 33 35 1E 78 FD 25 84 37 81  ...$..135.x.%.7.
0050:  E9 20 12 D5 18 48 94 9C 25 C4 EC 08 99 7A 94 AE  . ...H..%....z..
0060:  DC 52 C1 EE DA 3F AC 63 18 8C C8 87 8B F4 68 3B  .R...?.c......h;
0070:  A7 DE 71 EC 16 39 7F 0C FC A5 3A 9E 84 F5 25 94  ..q..9....:...%.
0080:  5A D2 D6 BB 9B 72 8A 51 EF 3F 76 4B E0 0F 5C AF  Z....r.Q.?vK..\.
0090:  54 4F 53 13 9E 49 36 8E 5E DA 04 48 3D D3 6E B1  TOS..I6.^..H=.n.
00a0:  AE 6C EE 7A 4B 52 26 64 36 FF 16 36 90 D4 4E 2C  .l.zKR&d6..6..N,
00b0:  4F 0B 1C AF AC B1 B6 04 26 6C 33 61 F7 BF 20 BA  O.......&l3a.. .
00c0:  24 B4 28 17 0E 52 33 00 4B BE 1C 3F F1 52 2D 9D  $.(..R3.K..?.R-.
00d0:  BD 5A 37 A2 1C AF 2E 9E 6B FE 6F A5 1C 4A 9F CF  .Z7.....k.o..J..
00e0:  3E BC 0F 55 4D 90 4E C4 0B C1 9B D2 7B 52 3D F9  >..UM.N.....{R=.
00f0:  45 F1 72 19 66 51 2B 5C CF 1A 21 BB 1C 77 EB D7  E.r.fQ+\..!..w..
0100:  09 04 34 63                                      ..4c

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B AB 91 28 D0 22 F1 12 A0 69 3A 1D  .......(."...i:.

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 12  .....|..........
0010:  ED 5A 23 33 4F 22 BB 8E 8E 9D 7E F0 4D 8F 41 35  .Z#3O"....~.M.A5
0020:  1B F2 90 28 17 E1 EC 1E 76 9E 11 56 1D 45 31 FA  ...(....v..V.E1.
0030:  43 EB 5E B7 18 3E B6 A3 DC 43 FC B5 09 58 A6 BF  C.^..>...C...X..
0040:  00 32 84 BE BD 0D E3 13 CA DC 05 20 EA 6E 9D C8  .2......... .n..
0050:  41 37 5C 6B ED 15 F1 02 2C 50 80 B8 FF 57 B9 48  A7\k....,P...W.H
0060:  E3 1E 1B D4 F4 CA 8D 75 DC 3E 87 04 AB 80 AA 5C  .......u.>.....\
0070:  06 75 8B A8 29 F0 B5 6F A5 F6 73 01 DF C7 04 F2  .u..)..o..s.....
0080:  67 E4 53 BB 21 3E 7F 2E C7 F1 F6 F6 7C BD 17 04  g.S.!>......|...
0090:  C1 7F 4D 00 76 D9 93 82 2A 58 56 66 81 4E D3 A2  ..M.v...*XVf.N..
00a0:  41 B6 E3 73 14 3C D8 86 CF 83 5F C0 8F 02 B5 84  A..s.<...._.....
00b0:  0C BD 3D 76 D0 A5 38 E1 49 88 CD 56 81 1D E6 C7  ..=v..8.I..V....
00c0:  F8 F0 75 76 0A AE 7C F4 D1 8F 28 4A 96 0F B2 A9  ..uv..|...(J....
00d0:  37 42 50 5A E8 5E EB 3E 60 1D 7F C1 A7 E0 B1 13  7BPZ.^.>`.......
00e0:  11 AE FD 1F A1 61 CA D7 E9 6D AF CB 18 15 B3 28  .....a...m.....(
00f0:  57 B7 16 F8 A8 5D 00 94 A4 A4 09 47 5D C2 89 59  W....].....G]..Y
0100:  50 4D B3 A6                                      PM..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 2C AA 4C ED 55 E4 1D CC E3 9A AF  .....,.L.U......

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 5F  .....|........._
0010:  00 F4 59 8A 60 C9 3F 20 11 2D 8B E5 FD FA 04 19  ..Y.`.? .-......
0020:  BF D2 EB 1F 13 98 46 17 2F CF 62 E6 8F 38 86 FF  ......F./.b..8..
0030:  FB 34 F3 64 4D 67 A2 39 1C 82 9B A4 BC 52 14 8C  .4.dMg.9.....R..
0040:  38 2E 5D 10 C0 7D 1A D8 E3 E9 4E 2C 16 56 10 F9  8.]..}....N,.V..
0050:  37 8D 72 A5 2B 64 74 43 89 D6 F0 30 BB C1 00 80  7.r.+dtC...0....
0060:  49 B7 8F FE AD 15 78 46 44 8C 97 66 90 E3 90 64  I.....xFD..f...d
0070:  E6 F5 78 D5 B6 36 7C 33 38 A0 3B BC B7 60 9E 0D  ..x..6|38.;..`..
0080:  0E 37 15 3E 78 D7 D2 B4 31 AD A0 D3 87 45 C5 2D  .7.>x...1....E.-
0090:  A1 09 5E 0C 9A 6F 13 50 D0 D3 E8 9E B4 AE 3A BA  ..^..o.P......:.
00a0:  EE 93 29 B9 4E 51 C0 A9 14 E9 DE 76 FE A6 25 20  ..).NQ.....v..% 
00b0:  43 CE AC 6D EA E8 71 D4 A4 72 94 45 AA 88 39 46  C..m..q..r.E..9F
00c0:  3E 1F D0 6A 74 80 CF 12 3C 1E A4 87 DB D3 DA 2E  >..jt...<.......
00d0:  A7 C5 FC BE D6 A7 A8 BA A0 A3 70 D8 AE 63 37 AE  ..........p..c7.
00e0:  27 00 2B 20 22 F0 51 06 8B 99 B3 71 99 65 A8 9B  '.+ ".Q....q.e..
00f0:  16 E1 53 28 44 C7 63 2D 02 BA 8A DE A7 01 10 A3  ..S(D.c-........
0100:  52 92 C3 3F                                      R..?

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 51 7E 53 95 E4 92 29 8C 95 23 C2  .....Q~S...)..#.

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 3B  .....|.........;
0010:  7E 2E D3 70 58 36 D9 C3 32 AF AB BB 72 7F 74 2B  ~..pX6..2...r.t+
0020:  03 C1 29 E9 DC 4E B6 39 0F C2 A4 69 7B 94 A9 28  ..)..N.9...i{..(
0030:  8F 6C CC 74 23 05 A4 44 55 77 0C 05 E8 A8 A4 47  .l.t#..DUw.....G
0040:  9D AC FF CB F7 C8 7E 8D 82 F3 84 CF 13 B7 E1 76  ......~........v
0050:  EF EF 24 FB 30 46 1A 9A 24 88 26 4E 73 FF 5C 0E  ..$.0F..$.&Ns.\.
0060:  56 D2 95 B1 17 DB 6F D3 E3 3E 11 A8 5A F8 C0 F0  V.....o..>..Z...
0070:  39 CC E7 4F C1 B7 79 B5 F2 F0 C4 B2 6E EA 2A CF  9..O..y.....n.*.
0080:  89 F5 C5 FF B2 4D 17 4B 9F 03 55 FA 47 09 B5 28  .....M.K..U.G..(
0090:  7A D1 AB 37 EC DE AA EA 57 4E 32 79 66 8E A6 E0  z..7....WN2yf...
00a0:  24 F3 47 59 61 E7 2B AD CB 2B 21 63 43 C7 D3 C9  $.GYa.+..+!cC...
00b0:  3C D0 FC EF A2 A9 7B 2A B3 A8 D6 1C DD 66 56 EA  <.....{*.....fV.
00c0:  B1 E6 3D 76 20 4D 0D 98 CC 04 76 29 82 4F FB 4B  ..=v M....v).O.K
00d0:  5B 86 FC 9F 74 20 72 0B 09 75 7E 61 8C C7 32 68  [...t r..u~a..2h
00e0:  82 B1 B7 33 2D CD 60 7E AB 26 C2 51 69 61 9A 82  ...3-.`~.&.Qia..
00f0:  04 26 02 8A 35 56 45 E7 5E F2 13 AC A1 42 3D 3B  .&..5VE.^....B=;
0100:  21 6E 61 96                                      !na.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 89 1B 72 45 EA D1 87 6D 72 DA 48  .......rE...mr.H

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 8D  .....|..........
0010:  CB 76 A3 6C C8 64 C1 AA CB 59 CA 2E C9 79 DF 3D  .v.l.d...Y...y.=
0020:  F8 6B D3 78 94 36 D7 AB 17 34 22 9D 80 E3 8F 0B  .k.x.6...4".....
0030:  A6 FC 3B 64 6C 01 66 CA E2 C7 D1 40 7D 4A 97 9C  ..;dl.f....@}J..
0040:  99 25 78 7F 6D F9 86 9E F7 24 A8 5C 1B 2C 1F 7C  .%x.m....$.\.,.|
0050:  7C 8C 23 22 A7 0E 26 55 8C 2F BD FA 07 2A D1 37  |.#"..&U./...*.7
0060:  EB 18 2E E0 BA C3 EF 2C CC 7A BD CE 5A E8 E7 99  .......,.z..Z...
0070:  1A 65 0F 0E 7C B9 10 9F C0 DB 61 EA 90 21 52 95  .e..|.....a..!R.
0080:  E3 39 23 78 9D FE C7 2F 7B D8 AB AD DB 45 16 47  .9#x.../{....E.G
0090:  8A DD 7C F9 1D 61 D1 FE 4A E6 3C D5 E8 6C 1A 52  ..|..a..J.<..l.R
00a0:  01 9F A2 53 9B 82 21 5E A2 8F 09 FB EE B3 7D 09  ...S..!^......}.
00b0:  01 8C 45 7A 1C F3 8E AD C5 34 EB B3 2B B9 2E 1E  ..Ez.....4..+...
00c0:  33 3C 8D 0B 1C FB 46 F8 CF 36 1B 45 6E 73 6E 8E  3<....F..6.Ensn.
00d0:  A7 AD F1 EB A1 E1 4A D8 C6 49 2D C8 2B 90 2A F3  ......J..I-.+.*.
00e0:  E3 C2 59 2B EC A6 D1 1C 29 E0 4E 5E CC 88 DE 86  ..Y+....).N^....
00f0:  84 82 97 9F B9 41 5E 2D F8 FD 6C 29 D9 D1 EF C7  .....A^-..l)....
0100:  18 7A C0 BE                                      .z..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 9B 9C 6D 3F BA E1 1F 39 51 58 F9  .......m?...9QX.

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 B7 C6 65 75 FC 8D B7 29 90 00        |.....eu...)..

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 E1 CA E4 27 A8 4C AF  .....|......'.L.
0010:  B6 81 08 FE D8 BC 1C 8C 3F 92 E5                 ........?..

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 7B 13 61 00 2F 76 24 8D 90 00        |...{.a./v$...

Command  10 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 00 9D 05 AC 03 80 01 07                    .G........

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 98 65 61 0B 97 69 A9  .I........ea..i.
0010:  02 75 EE 1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED  .u....>s.V3...J.
0020:  E6 17 20 CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5  .. ........q....
0030:  E4 6F 5D 9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37  .o]...Z....X.R.7
0040:  1C 54 BA B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55  .T..S.....:*..LU
0050:  D6 8C 98 98 02 96 D5 66 5A DA C5 7E BF 4A AE 49  .......fZ..~.J.I
0060:  AC B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46  .......e..T....F
0070:  0A A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE  ..0.G=..Aul.g"..
0080:  17 15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79  ...(Y.......Njdy
0090:  BD 59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84  .Y/xj"e.d..n[...
00a0:  A6 79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23  .y..B*.*.1e.+..#
00b0:  0D 89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80  ..a.<.d..U....a.
00c0:  58 FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44  X.#...Sg .y...qD
00d0:  B9 E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3  ...9....8...HY&.
00e0:  6A 86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB  j.".F8..S.z#.f..
00f0:  B5 BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 61 10  ..yO..........a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  25 D0 0B 1C 8E 6E C4 AA A9 97 55 82 03 01 00 01  %....n....U.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9D FF 7C 82 01 06 82 00 81 82 01 00 00  .....|..........
0010:  01 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0020:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0030:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0040:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0050:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0060:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0070:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0080:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
0090:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
00a0:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
00b0:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
00c0:  FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF  ................
00d0:  FF FF FF FF FF FF FF FF FF FF FF 00 30 31 30 0D  ............010.
00e0:  06 09 60 86 48 01 65 03 04 02 01 05 00 04 20 29  ..`.H.e....... )
00f0:  64 E1 74 4E 4A 07 59 C8 D5 33 B0 D9 4B 40 9D 5F  d.tNJ.Y..3..K@._
0100:  3B 6C 85 B0                                      ;l..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9D 0B 4D E4 2D 51 D0 4D A4 A2 E1 80 69  .....M.-Q.M....i

Response 256 bytes: 61 0A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 33 E3 DF 87 83 B6 B0 A5  |.......3.......
0010:  76 77 01 E7 71 F1 AE 94 2C 55 F9 B6 81 23 64 5F  vw..q...,U...#d_
0020:  F8 A0 35 C0 FE 30 75 63 9C D5 8C 6F B7 DB 9B 73  ..5..0uc...o...s
0030:  0E 10 66 A2 B5 F8 EC 1C D9 C0 99 64 65 75 51 0D  ..f........deuQ.
0040:  C6 57 DC 27 8E 85 34 BF B3 CD FA A1 F4 20 65 C9  .W.'..4...... e.
0050:  D8 E6 0A 97 C1 13 4C 61 BE 5E 9D 3B CB 11 CA 3E  ......La.^.;...>
0060:  0F 8F CE A6 73 58 34 93 FB 1D 42 D7 C2 89 86 43  ....sX4...B....C
0070:  F5 69 3C 0B 99 5A 2F FE 3F 4A AD 45 1F 55 2B 8C  .i<..Z/.?J.E.U+.
0080:  84 08 F2 A1 20 7C BD B2 E7 47 8F FA C0 DC 80 BB  .... |...G......
0090:  52 BE 98 55 2B 2C 95 60 A9 F6 B4 76 61 7E 80 0A  R..U+,.`...va~..
00a0:  AE 85 BE 19 E3 14 E2 A6 B5 EC 54 45 70 57 95 33  ..........TEpW.3
00b0:  87 22 24 4F 9C 9E AB AD 46 80 1A 2A 9D 16 55 B8  ."$O....F..*..U.
00c0:  DA 46 B9 CB D8 EA 4F 26 36 E2 85 DF C3 95 A9 89  .F....O&6.......
00d0:  5E 07 5F 3E 53 30 DF AD 19 56 58 CA 27 89 E9 D4  ^._>S0...VX.'...
00e0:  F0 E2 0E A4 19 2D 17 5B 9D CE E4 60 1A 04 C1 E0  .....-.[...`....
00f0:  1A FC FD 48 D4 94 C3 98 6A 53 1A BC 4E 5F 61 0A  ...H....jS..N_a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 12 bytes: 90 00  [I] Command successfully executed (OK).
0000:  91 D8 B8 E4 45 97 75 91 32 DD 90 00              ....E.u.2...
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command   9 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 04 7C 02 80 00                       .....|...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 80 08 E8 62 26 34 12 7F 7E F1 90 00        |....b&4..~...

Command  27 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 03 9B 16 7C 14 80 08 10 E3 BD F6 40 E8 B9  .....|.......@..
0010:  13 81 08 F2 43 A3 0E 77 D8 B3 E9                 ....C..w...

Response 14 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7C 0A 82 08 60 00 57 36 8D 9D 8A 91 90 00        |...`.W6......

Command  260 bytes: DB     PUT DATA   x
0000:  10 DB 3F FF FF 5C 03 5F C1 0B 53 82 02 C0 70 82  ..?..\._..S...p.
0010:  02 B7 30 82 02 B3 30 82 01 9B A0 03 02 01 02 02  ..0...0.........
0020:  09 00 F5 AD 37 06 9A 5B AE 12 30 0D 06 09 2A 86  ....7..[..0...*.
0030:  48 86 F7 0D 01 01 0B 05 00 30 19 31 17 30 15 06  H........0.1.0..
0040:  03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72 6C  .U....hello worl
0050:  64 20 39 64 30 1E 17 0D 31 37 30 36 30 35 30 39  d 9d0...17060509
0060:  33 36 31 30 5A 17 0D 31 38 30 36 30 35 30 39 33  3610Z..180605093
0070:  36 31 30 5A 30 19 31 17 30 15 06 03 55 04 03 0C  610Z0.1.0...U...
0080:  0E 68 65 6C 6C 6F 20 77 6F 72 6C 64 20 39 64 30  .hello world 9d0
0090:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
00a0:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00b0:  98 65 61 0B 97 69 A9 02 75 EE 1F F7 89 3E 73 AF  .ea..i..u....>s.
00c0:  56 33 81 9B 09 4A ED E6 17 20 CF 9F FB EB 05 CC  V3...J... ......
00d0:  DB 8C 71 B3 B3 A0 E5 E4 6F 5D 9C 18 E8 5A B8 B3  ..q.....o]...Z..
00e0:  05 8C 58 14 52 CE 37 1C 54 BA B9 53 06 C4 1D 86  ..X.R.7.T..S....
00f0:  B9 3A 2A E9 98 4C 55 D6 8C 98 98 02 96 D5 66 5A  .:*..LU.......fZ
0100:  DA C5 7E BF                                      ..~.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: DB     PUT DATA   x
0000:  10 DB 3F FF FF 4A AE 49 AC B3 AB 9C ED E7 E9 65  ..?..J.I.......e
0010:  0F F1 54 CD 89 14 B1 46 0A A0 30 12 47 3D A0 7F  ..T....F..0.G=..
0020:  41 75 6C 07 67 22 EB EE 17 15 D8 28 59 A7 E1 C3  Aul.g".....(Y...
0030:  F9 A5 F9 E2 4E 6A 64 79 BD 59 2F 78 6A 22 65 C0  ....Njdy.Y/xj"e.
0040:  64 02 D4 6E 5B 9D C9 84 A6 79 F6 EA 42 2A 89 2A  d..n[....y..B*.*
0050:  E3 31 65 FE 2B 12 EC 23 0D 89 61 10 3C C6 64 02  .1e.+..#..a.<.d.
0060:  94 55 CF AE BC 9C 61 80 58 FE 23 EC 0C 00 53 67  .U....a.X.#...Sg
0070:  20 B5 79 BA 91 85 71 44 B9 E4 0C 39 AF D4 B4 8F   .y...qD...9....
0080:  38 DD 13 A4 48 59 26 B3 6A 86 22 19 46 38 85 12  8...HY&.j.".F8..
0090:  53 D0 7A 23 F8 66 DC FB B5 BB 79 4F CB 98 95 B8  S.z#.f....yO....
00a0:  B8 C3 9E EB 86 B1 25 D0 0B 1C 8E 6E C4 AA A9 97  ......%....n....
00b0:  55 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7 0D  U.....0...*.H...
00c0:  01 01 0B 05 00 03 82 01 01 00 33 E3 DF 87 83 B6  ..........3.....
00d0:  B0 A5 76 77 01 E7 71 F1 AE 94 2C 55 F9 B6 81 23  ..vw..q...,U...#
00e0:  64 5F F8 A0 35 C0 FE 30 75 63 9C D5 8C 6F B7 DB  d_..5..0uc...o..
00f0:  9B 73 0E 10 66 A2 B5 F8 EC 1C D9 C0 99 64 65 75  .s..f........deu
0100:  51 0D C6 57                                      Q..W

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  208 bytes: DB     PUT DATA   x
0000:  00 DB 3F FF CB DC 27 8E 85 34 BF B3 CD FA A1 F4  ..?...'..4......
0010:  20 65 C9 D8 E6 0A 97 C1 13 4C 61 BE 5E 9D 3B CB   e.......La.^.;.
0020:  11 CA 3E 0F 8F CE A6 73 58 34 93 FB 1D 42 D7 C2  ..>....sX4...B..
0030:  89 86 43 F5 69 3C 0B 99 5A 2F FE 3F 4A AD 45 1F  ..C.i<..Z/.?J.E.
0040:  55 2B 8C 84 08 F2 A1 20 7C BD B2 E7 47 8F FA C0  U+..... |...G...
0050:  DC 80 BB 52 BE 98 55 2B 2C 95 60 A9 F6 B4 76 61  ...R..U+,.`...va
0060:  7E 80 0A AE 85 BE 19 E3 14 E2 A6 B5 EC 54 45 70  ~............TEp
0070:  57 95 33 87 22 24 4F 9C 9E AB AD 46 80 1A 2A 9D  W.3."$O....F..*.
0080:  16 55 B8 DA 46 B9 CB D8 EA 4F 26 36 E2 85 DF C3  .U..F....O&6....
0090:  95 A9 89 5E 07 5F 3E 53 30 DF AD 19 56 58 CA 27  ...^._>S0...VX.'
00a0:  89 E9 D4 F0 E2 0E A4 19 2D 17 5B 9D CE E4 60 1A  ........-.[...`.
00b0:  04 C1 E0 1A FC FD 48 D4 94 C3 98 6A 53 1A BC 4E  ......H....jS..N
00c0:  5F 91 D8 B8 E4 45 97 75 91 32 DD 71 01 00 FE 00  _....E.u.2.q....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9D FF 7C 82 01 06 82 00 81 82 01 00 05  .....|..........
0010:  17 52 3A 4A A1 82 2C 0C 31 4C AA F0 07 E4 4A CA  .R:J..,.1L....J.
0020:  42 FE AA 4B 89 5B A4 B5 1F D5 BC BE 1C 2D B5 67  B..K.[.......-.g
0030:  8B 83 5E 6F C3 40 5E BF 50 04 79 9B F2 BD A1 06  ..^o.@^.P.y.....
0040:  98 2C AD 45 03 89 91 C3 AA 4B 98 E1 A2 EF 57 83  .,.E.....K....W.
0050:  D2 1E F2 56 58 F9 A2 F7 6E 80 65 7A F8 1A 38 23  ...VX...n.ez..8#
0060:  CE 5F 6D FB A7 EA BB 9D 5E 87 D3 7D 4E 47 53 00  ._m.....^..}NGS.
0070:  35 75 EB 89 26 E2 C4 12 CD 34 4B AF CC 54 7C 14  5u..&....4K..T|.
0080:  9F 38 57 AB 93 E5 82 72 69 29 04 92 46 34 8F 55  .8W....ri)..F4.U
0090:  39 78 EA 02 81 DD 11 B8 B6 7F E9 22 75 C7 7E 03  9x........."u.~.
00a0:  53 D8 F7 18 BD 7F 79 E7 12 FB FA 92 E6 53 2D 5B  S.....y......S-[
00b0:  AD 05 10 CA F6 2A 8E 5B 8D 06 AA CF C9 F9 56 F9  .....*.[......V.
00c0:  3D 4B DD 05 30 51 5A 3E BD E2 BE FB 16 39 EC 13  =K..0QZ>.....9..
00d0:  DB 1B A7 BC E6 71 15 7B 95 DE 88 4D 75 20 C6 11  .....q.{...Mu ..
00e0:  0A F6 00 CE 86 75 BE D9 C2 36 55 CF 6D EC 92 18  .....u...6U.m...
00f0:  84 94 5A E5 73 93 A6 4E CB D1 4D 1C 74 9C A2 9C  ..Z.s..N..M.t...
0100:  E3 2C 65 C3                                      .,e.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9D 0B E0 94 53 84 9C 6D BC F3 5A 01 08  .......S..m..Z..

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9D FF 7C 82 01 06 82 00 81 82 01 00 64  .....|.........d
0010:  FA 78 F5 4D 8A 7B 79 78 1C 3C 3B 17 D0 39 05 91  .x.M.{yx.<;..9..
0020:  D4 12 DD 88 9D 8D A8 F4 A9 8C FF DA BD 01 C1 89  ................
0030:  1F BF B1 1C BB 66 2B 74 4B 2D 0E 7E 8D E3 A8 5E  .....f+tK-.~...^
0040:  12 78 57 29 B1 B1 72 17 B2 70 61 04 00 F8 BB 34  .xW)..r..pa....4
0050:  0D 02 E0 4D 22 FA BF AB FF 4B 5C 95 8F 78 05 E6  ...M"....K\..x..
0060:  D0 1F 4B D4 E8 E2 70 6E 7F 33 07 42 BE BF 9C 55  ..K...pn.3.B...U
0070:  50 F2 A7 C7 4B C2 40 DE 6D 4E A4 B6 2B 17 E1 76  P...K.@.mN..+..v
0080:  D9 34 D6 B7 D9 21 3D 3C 5A 44 14 DA 6F 59 88 AC  .4...!=<ZD..oY..
0090:  34 EE 06 F8 73 CD 45 78 77 C7 8B 9B FC AD 63 E6  4...s.Exw.....c.
00a0:  58 49 0C F4 F4 0E D2 B3 37 CF 85 5D 93 37 69 C3  XI......7..].7i.
00b0:  AB F3 83 8C 38 DE 14 96 A0 49 A1 FD 7C 57 CA D6  ....8....I..|W..
00c0:  BD 92 48 55 78 79 C9 09 67 B8 7B 1E 31 07 8E 00  ..HUxy..g.{.1...
00d0:  62 E8 4F 27 96 3B 84 1D B4 31 C7 50 43 60 F3 99  b.O'.;...1.PC`..
00e0:  CF D6 3A 9D 83 93 EF A9 F8 4F C4 D8 91 C2 43 07  ..:......O....C.
00f0:  58 25 2C 0B 24 03 81 F9 B0 C2 C5 A3 DF F2 09 44  X%,.$..........D
0100:  F5 F6 5B 0A                                      ..[.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9D 0B F8 6B B3 A0 05 80 FB 85 7A 8B 7D  ......k......z.}

Response 256 bytes: 61 0A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 00 02 84 ED B1 35 38 74  |............58t
0010:  4C 7D B2 6E 53 99 A5 94 45 3C BC 03 B3 5B ED A0  L}.nS...E<...[..
0020:  E6 09 DF A5 D7 90 EE BC 53 3B E3 EB 0F BB 31 B7  ........S;....1.
0030:  C8 63 1C C8 A8 86 A5 1A 16 74 72 A4 77 80 D1 1D  .c.......tr.w...
0040:  FB 4B 54 EA B9 5C A9 32 04 14 F7 9B 0A B0 F9 28  .KT..\.2.......(
0050:  72 04 C4 A0 14 04 FB B2 F0 60 C4 76 E9 43 D0 F8  r........`.v.C..
0060:  A4 97 58 96 4C 41 3C D3 63 3F E7 F0 17 04 24 90  ..X.LA<.c?....$.
0070:  A9 47 8C DE 47 C1 86 A0 71 08 3F 18 F7 7A C6 6C  .G..G...q.?..z.l
0080:  6C 61 54 BC F6 3E 40 F9 A3 AC F5 76 F9 E1 52 5C  laT..>@....v..R\
0090:  BA E6 CD D4 2C CB C4 A7 82 F7 0D C9 32 03 F6 1F  ....,.......2...
00a0:  5F F8 1E 7F CA F5 D0 90 88 B0 98 A1 1F 43 F1 67  _............C.g
00b0:  68 B8 94 43 F9 E9 E3 EE CF 0D 6A 03 AF 50 39 9B  h..C......j..P9.
00c0:  32 BB A5 1A 1A 27 D8 F1 CA 87 A7 28 69 26 25 3A  2....'.....(i&%:
00d0:  93 CD 17 FD 24 D0 42 92 C0 90 C2 DF 4C 9B E9 10  ....$.B.....L...
00e0:  02 4C D5 8D 94 A0 99 00 38 89 47 DA 05 E6 F3 75  .L......8.G....u
00f0:  C0 40 BF 04 61 40 0B EE B0 2E E8 9A 9B 11 61 0A  .@..a@........a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 12 bytes: 90 00  [I] Command successfully executed (OK).
0000:  3C 98 83 43 1E 38 43 49 E9 CF 90 00              <..C.8CI....
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 1F  .....|..........
0010:  31 9F 67 B4 E0 25 32 B7 09 42 6A D2 F9 48 5F 79  1.g..%2..Bj..H_y
0020:  8F F1 F1 50 C4 55 B9 3C 1C B6 2E B1 61 CE 3D 21  ...P.U.<....a.=!
0030:  7E 67 BF 4D 76 B6 89 87 5A B2 B2 A2 B8 FD E0 95  ~g.Mv...Z.......
0040:  5D D1 58 D1 A8 AF F9 E2 23 91 BB 3C 69 7F 16 04  ].X.....#..<i...
0050:  67 08 E1 E7 26 07 9E 3D 27 4A 11 26 E4 06 9F E5  g...&..='J.&....
0060:  C7 13 45 A4 AD C1 EB EE D9 11 CB 2E 26 B3 A2 71  ..E.........&..q
0070:  6E B7 17 1C 74 F4 58 5F E0 8F 22 36 F8 52 4C 96  n...t.X_.."6.RL.
0080:  1F 3A 83 53 12 68 A0 F2 24 C3 C4 66 D0 58 C2 6B  .:.S.h..$..f.X.k
0090:  58 9F 9E D7 F1 A5 08 3F 37 BC 1F 45 C4 E5 94 25  X......?7..E...%
00a0:  E3 21 93 45 AF 83 28 71 FF 8A CF 35 2D 3B 0F 6A  .!.E..(q...5-;.j
00b0:  1B D3 C8 5F 87 3F 51 3D AE 35 A3 12 52 0D 12 2F  ..._.?Q=.5..R../
00c0:  B7 23 84 07 84 83 B2 56 C2 7C D5 9A D8 B1 09 44  .#.....V.|.....D
00d0:  32 B9 56 67 44 C4 21 C5 44 6E 69 F5 83 1B 07 94  2.VgD.!.Dni.....
00e0:  6D 0B 16 A0 29 53 BA 63 C5 5B 5E 91 07 92 DC 98  m...)S.c.[^.....
00f0:  8C 91 48 23 33 B8 57 7C 18 D3 CA 40 FD 02 A4 23  ..H#3.W|...@...#
0100:  BB 42 1D CF                                      .B..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B D4 4B C8 94 2C EF 39 23 78 BF 6D  ......K..,.9#x.m

Response 256 bytes: 61 0A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 00 02 7D 38 AA CB 87 D2  |.........}8....
0010:  60 49 BA 13 89 55 52 F0 10 E8 47 C0 14 B1 98 35  `I...UR...G....5
0020:  E1 B3 41 E4 9B 19 1D 46 BB 25 22 56 56 8A 71 60  ..A....F.%"VV.q`
0030:  E7 D3 E4 83 96 1F 2E 05 5E C0 21 4D 11 3C 48 6E  ........^.!M.<Hn
0040:  BD 5D DC DF 64 95 56 F7 CC C5 6C DE 0F BC B5 28  .]..d.V...l....(
0050:  78 22 6F EA 37 49 A1 84 0C 1F 89 0E 09 F4 AE 89  x"o.7I..........
0060:  AB E2 EC FB 87 4B 76 45 C7 99 4E 5A E2 EB B1 4A  .....KvE..NZ...J
0070:  AE 3D 87 CC 4C B7 D8 10 56 BA 98 2F 10 F6 29 B2  .=..L...V../..).
0080:  3E 0E 74 86 45 69 1C 2F 5E 5C 5E 3F F6 F7 6F 2B  >.t.Ei./^\^?..o+
0090:  16 69 15 22 E5 A8 D5 67 68 BE 63 9F 1B 4F 59 72  .i."...gh.c..OYr
00a0:  32 3A 77 B8 1B 86 11 ED DE 9A 1E 15 55 27 B0 C4  2:w.........U'..
00b0:  E2 9F D7 C5 15 BD E5 8E 70 4F CF 3B 06 DF 78 CF  ........pO.;..x.
00c0:  7D 8A 3A E5 D6 8F 0C 57 67 AA D2 70 A7 9B 3F 19  }.:....Wg..p..?.
00d0:  30 7A 55 64 85 81 C1 E7 42 0A 01 FB 54 5D 50 B3  0zUd....B...T]P.
00e0:  58 E1 AB C3 E1 2E B5 00 0E 26 F7 C2 D4 D9 39 9E  X........&....9.
00f0:  85 B0 B2 BC CA 08 6A E4 3C 26 61 F0 92 25 61 0A  ......j.<&a..%a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 12 bytes: 90 00  [I] Command successfully executed (OK).
0000:  CB 93 B0 08 A8 20 3C 81 0E 1C 90 00              ..... <.....
Reset
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....
Power Down
Power Up

Command  10 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 05 A0 00 00 03 08                    ..........

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 5E  .....|.........^
0010:  0E 61 4B 3B EE 9E FC D7 AE 76 CC 75 B3 4A 29 BD  .aK;.....v.u.J).
0020:  59 0C 88 E6 B2 23 F2 78 28 40 B0 F4 3B 08 8C 50  Y....#.x(@..;..P
0030:  AD E2 17 3C 64 66 9F 12 9F 93 40 84 60 D7 DE 3A  ...<df....@.`..:
0040:  53 06 22 AF 49 57 55 77 C1 D8 5A 71 41 6A B2 E5  S.".IWUw..ZqAj..
0050:  63 5B A4 76 B7 B8 89 E4 F7 C7 0D EF CC 20 11 11  c[.v......... ..
0060:  1E 69 DF 9D CF AC E1 14 4D 95 08 E3 DA 28 DC 09  .i......M....(..
0070:  11 B7 83 BD 24 B3 E9 7C 45 C7 56 60 CE EF 37 30  ....$..|E.V`..70
0080:  9A 84 F9 43 13 88 1B 76 BB 12 7B BD DA 04 68 87  ...C...v..{...h.
0090:  9F 1E A3 B5 FA 22 49 C5 05 2D 5A 67 59 0C 14 FA  ....."I..-ZgY...
00a0:  F4 AC 1A 99 16 4E DD 4A 14 B9 26 AD 52 2C 6E 2D  .....N.J..&.R,n-
00b0:  3C A7 81 0A 76 B3 26 F9 DD 5A D3 84 64 20 67 25  <...v.&..Z..d g%
00c0:  B0 B6 EB D8 B2 22 D0 F0 75 83 45 0D 83 27 DA 42  ....."..u.E..'.B
00d0:  B0 31 69 92 B1 44 8C 09 5B 03 D1 C5 CC 8D FC 9D  .1i..D..[.......
00e0:  BD 4C 13 51 AA A3 03 6C 01 8C 98 8A 58 A0 EE 60  .L.Q...l....X..`
00f0:  65 27 B1 A8 79 6D CC 78 8C A9 5B 3D EC 12 CF 0E  e'..ym.x..[=....
0100:  55 28 F6 1C                                      U(..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  16 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 5E 29 CA FF 31 78 96 0D 67 44 9E  .....^)..1x..gD.

Response 256 bytes: 61 0A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 00 02 C1 EB 21 81 D8 7A  |...........!..z
0010:  49 E2 B9 82 56 1A A1 0C 3F 71 86 7C 30 12 32 56  I...V...?q.|0.2V
0020:  94 4C F5 FE 98 61 B9 C0 84 EE E5 F7 A3 65 DB 03  .L...a.......e..
0030:  4F 8B B8 07 F6 BB AD 01 26 02 C4 11 14 55 BE 83  O.......&....U..
0040:  C1 14 0E 08 CC 8A 3A 9B 0F BA 08 90 17 29 DA E1  ......:......)..
0050:  C7 E4 F6 A2 30 61 58 D5 1D 77 A8 B0 5B 41 01 61  ....0aX..w..[A.a
0060:  ED 28 AF F4 FB 42 ED 27 2E B3 42 8F 52 61 4D D6  .(...B.'..B.RaM.
0070:  A0 94 EE C8 AE 62 39 51 85 4F E6 67 86 74 AE D7  .....b9Q.O.g.t..
0080:  52 89 1D AB 69 40 4D 88 E1 2F C0 57 2D 67 9B 3B  R...i@M../.W-g.;
0090:  55 6A E5 8B 34 88 DB C6 0D 3B 47 8D 3F 32 86 55  Uj..4....;G.?2.U
00a0:  CD E6 C2 65 AA 43 2B A1 51 E9 8C 66 E7 24 45 F3  ...e.C+.Q..f.$E.
00b0:  FB 46 C2 7F FF 8B A3 66 E8 A7 CF 48 86 3B 27 04  .F.....f...H.;'.
00c0:  37 A3 AE 11 2A 4F A2 EC 93 AD A6 DB 44 0E 22 5C  7...*O......D."\
00d0:  6D CB 66 3F 88 A6 6F E8 23 43 41 B7 09 1D B3 0E  m.f?..o.#CA.....
00e0:  CB E0 34 D8 38 45 CC 00 CB B6 E7 4C 5C 8A 30 1E  ..4.8E.....L\.0.
00f0:  0B 24 9B 24 EB 09 69 93 6A D9 F7 34 DF 9E 61 0A  .$.$..i.j..4..a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 00                                   .....

Response 12 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 65 B0 7A 10 AC 34 11 E4 7F 90 00              4e.z..4.....
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 34 36 FF           . ...1234546.

Response  2 bytes: 63 C2  [W] Verify fail, 2 tries left.
0000:  63 C2                                            c.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C2  [W] Verify fail, 2 tries left.
0000:  63 C2                                            c.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C2  [W] Verify fail, 2 tries left.
0000:  63 C2                                            c.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 5E  .....|.........^
0010:  EE 44 13 5C 84 2E 69 06 88 75 1F 49 99 24 2C B3  .D.\..i..u.I.$,.
0020:  7A 0B 55 F4 FA B9 85 C6 E4 8C D7 61 BD 38 FA 56  z.U........a.8.V
0030:  A9 40 15 09 35 4A 9D 42 24 5D 21 47 0F 60 17 69  .@..5J.B$]!G.`.i
0040:  E0 55 22 5B 88 F1 BB B3 48 7F 9F 84 B9 C1 D0 0C  .U"[....H.......
0050:  32 65 62 CF 37 68 F2 E2 A2 84 0D 82 4B D9 5A 94  2eb.7h......K.Z.
0060:  FF 9A 6D 51 48 94 EA EF CB 43 F4 F4 5D 7D 71 0B  ..mQH....C..]}q.
0070:  EA 0B AD 16 41 90 02 D4 C5 B9 87 F3 E1 A1 7C BC  ....A.........|.
0080:  6B 4E 57 36 CD 65 C0 A2 67 09 58 D1 11 6E 4D 98  kNW6.e..g.X..nM.
0090:  77 C6 38 C2 D7 5E 9C 4D 7F 83 E2 60 54 ED D6 1C  w.8..^.M...`T...
00a0:  F5 56 FC 86 06 8A 58 15 C6 15 C1 AE A9 98 4C C8  .V....X.......L.
00b0:  B4 F5 53 F1 B4 B4 BA F3 DD 27 0A 4F 7F B6 38 A6  ..S......'.O..8.
00c0:  99 7F FC 7E 68 69 E8 80 EF B0 A6 BB 94 B1 52 5A  ...~hi........RZ
00d0:  6F 0C 87 98 39 0B C7 8F 45 02 E8 7E 87 D2 CF FF  o...9...E..~....
00e0:  14 8A E6 91 7B 17 C2 2B 4F C3 C2 49 A5 08 7A DB  ....{..+O..I..z.
00f0:  82 F7 49 59 9D AA EB B8 2E 8A D2 04 FB 52 01 70  ..IY.........R.p
0100:  62 8C DD 74                                      b..t

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  17 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 36 16 E0 29 27 9C 00 83 C6 D9 8A  .....6..)'......
0010:  00                                               .

Response 240 bytes: 61 1A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 8C 0A C8 A2 27 FD B1 FA  |...........'...
0010:  A9 64 86 1B 13 D2 C2 B2 D8 F3 66 C5 52 3F 39 24  .d........f.R?9$
0020:  FB D0 DB DE 8F 77 BB EF 54 D8 3E 91 76 60 84 20  .....w..T.>.v`. 
0030:  1F 5C 62 6C 09 E5 A4 1B 0C 75 A6 56 87 B5 81 C7  .\bl.....u.V....
0040:  9B DD 9D D2 89 3E 9E AC D6 AF 50 70 1E 4B CA 29  .....>....Pp.K.)
0050:  7E 7B 6A 4B 4F D4 B2 5A 8F F4 76 27 BB AE CE 54  ~{jKO..Z..v'...T
0060:  F0 8E 50 FC D1 E5 FD E9 AA 4C 42 6D CC D8 34 64  ..P......LBm..4d
0070:  C5 20 5F EA 0C A4 2E F0 23 08 51 6A D5 FE 85 B6  . _.....#.Qj....
0080:  52 C3 1F C1 BC C0 D8 93 9E 44 CC 86 54 0F 56 87  R........D..T.V.
0090:  96 EB 92 EE 43 5C AC D7 2B E4 9E F8 C2 60 5C 6F  ....C\..+....`\o
00a0:  67 12 FC AC 54 B1 E0 51 CD ED 2A 42 6F 1C 0A BD  g...T..Q..*Bo...
00b0:  58 CE 46 20 0E 01 4C C3 F5 08 2A 7C 90 05 43 F6  X.F ..L...*|..C.
00c0:  97 52 E1 2C E1 66 4E 21 93 14 1C BE F0 B8 38 57  .R.,.fN!......8W
00d0:  7E 9F EA 84 E3 64 92 18 17 69 8A E1 5B AD 95 63  ~....d...i..[..c
00e0:  ED AD C1 E3 63 2C A4 10 A6 BD 45 6F 14 55 61 1A  ....c,....Eo.Ua.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 1A                                   .....

Response 28 bytes: 90 00  [I] Command successfully executed (OK).
0000:  FE A7 33 51 E2 60 7B 4D 95 EF 8E D0 19 6A 08 32  ..3Q.`{M.....j.2
0010:  A8 50 40 65 1B 3D 60 ED B8 F1 90 00              .P@e.=`.....
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.
Reset
Power Down
