Connected to card in 'Yubico Yubikey 4 OTP+U2F+CCID 00 00'
Connected to virtual PCD at localhost:35963
Power Up
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 07 08                 ..?..\._...

Response 10 bytes: 61 2D  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 33 F0 15 A0 00 00 01 61 2D                    S3......a-

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 07 35                 ..?..\._..5

Response 55 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 33 F0 15 A0 00 00 01 16 FF 02 02 13 96 24 81  S3............$.
0010:  B4 51 41 F2 11 83 34 F4 FA F1 01 21 F2 01 21 F3  .QA...4....!..!.
0020:  00 F4 01 00 F5 01 10 F6 00 F7 00 FA 00 FB 00 FC  ................
0030:  00 FD 00 FE 00 90 00                             .......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 06 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 21 08                 ..?..\._.!.

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset
Power Down
Power Up

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 0C 06 D2 76 00 01 24 01                 ......v..$.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  12 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 D2 76 00 01 24 01 00              ......v..$..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 4F 10                                   ...O.

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D2 76 00 01 24 01 02 01 00 06 05 40 73 22 00 00  .v..$......@s"..
0010:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 6E 00                                   ...n.

Response 226 bytes: 90 00  [I] Command successfully executed (OK).
0000:  6E 81 DD 4F 10 D2 76 00 01 24 01 02 01 00 06 05  n..O..v..$......
0010:  40 73 22 00 00 5F 52 08 00 73 00 00 80 05 90 00  @s".._R..s......
0020:  7F 74 03 81 01 20 73 81 B7 C0 0A 3C 00 00 00 04  .t... s....<....
0030:  C0 00 FF 00 FF C1 06 01 08 00 00 11 00 C2 06 01  ................
0040:  08 00 00 11 00 C3 06 01 08 00 00 11 00 C4 07 FF  ................
0050:  7F 7F 7F 03 00 03 C5 3C A6 4E 2B FE A8 BA D3 07  .......<.N+.....
0060:  9C 09 B3 14 02 CF B3 52 E1 83 94 C7 0D C2 2E 61  .......R.......a
0070:  DA FE 3B 96 6E B6 47 9B 3F 83 51 39 14 B7 8B F8  ..;.n.G.?.Q9....
0080:  02 AB 9B 30 FC 63 B8 08 AB 19 1B 94 3C 9E D8 05  ...0.c......<...
0090:  C4 F6 A8 F7 C6 3C 00 00 00 00 00 00 00 00 00 00  .....<..........
00a0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00b0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00c0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00d0:  00 00 CD 0C 59 2E B8 8D 59 2E B8 8D 59 2E BA CF  ....Y...Y...Y...
00e0:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 5E 00                                   ...^.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 65 00                                   ...e.

Response 13 bytes: 90 00  [I] Command successfully executed (OK).
0000:  65 09 5B 00 5F 2D 00 5F 35 01 39 90 00           e.[._-._5.9..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 7A 00                                   ...z.

Response  9 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7A 05 93 03 00 00 00 90 00                       z........

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 01 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 02 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 03 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 04 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 5F 50 00                                   .._P.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 A4 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 A2 BF D6 7C F8 68 8B  .I..........|.h.
0010:  24 67 5C E1 56 B3 C3 D1 2A 9C 43 82 8F BA 64 2B  $g\.V...*.C...d+
0020:  55 40 0F DC BE 1E 42 31 CD B0 0D 62 58 F1 AE 83  U@....B1...bX...
0030:  9E 43 7F 41 08 F3 EA A4 98 BD 5E 43 68 44 A9 09  .C.A......^ChD..
0040:  93 BF 74 BB F9 67 6A 35 3D 89 AA CC D4 0F 55 24  ..t..gj5=.....U$
0050:  C8 05 D1 32 56 E6 A2 7D CA 77 2F CD AA 8A 30 15  ...2V..}.w/...0.
0060:  D9 C0 0C 88 5C FF 91 01 98 28 38 85 51 90 4A CB  ....\....(8.Q.J.
0070:  CB 62 C5 56 29 16 53 55 59 3F 66 AB 58 99 5E 92  .b.V).SUY?f.X.^.
0080:  8B 49 94 F0 A6 51 33 56 A6 B9 1B 7E 7B 5B 7C FA  .I...Q3V...~{[|.
0090:  07 28 24 E3 FC B6 1B 18 C0 62 B4 0B 44 46 47 DB  .($......b..DFG.
00a0:  BC D7 FD 09 36 6E F5 23 40 08 7B 35 1D 55 28 E7  ....6n.#@.{5.U(.
00b0:  44 41 A1 BF 21 3E 83 B0 26 5C BC 64 78 20 B1 C0  DA..!>..&\.dx ..
00c0:  86 81 B1 2F 00 BE 86 B4 16 AE D1 24 67 BC 59 E8  .../.......$g.Y.
00d0:  2A 29 F6 17 01 19 8E B1 B8 44 37 9F 99 8E B4 7F  *).......D7.....
00e0:  5B 7B 0A 10 C5 94 17 15 B8 7E F8 C2 88 05 B8 E1  [{.......~......
00f0:  E9 88 D6 29 E1 D7 2F 9D 23 D6 03 F0 0C A8 61 10  ...)../.#.....a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D3 6D CE EA 8A 5C EF 65 A8 0D 25 82 03 01 00 01  .m...\.e..%.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B6 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 E6 AA 79 0A D2 C2 D2  .I.........y....
0010:  E6 85 38 FF CC E9 08 0E 20 48 0D C1 4D E2 B7 A7  ..8..... H..M...
0020:  D1 DD 7E FD AE 71 3F 8D FE E5 F6 10 98 A9 59 2A  ..~..q?.......Y*
0030:  4E 60 88 81 20 26 3B 47 96 D9 96 52 0F 0F FC EA  N`.. &;G...R....
0040:  A7 00 8C CE 82 99 2B AD C8 F3 8D AD DC 09 8F 16  ......+.........
0050:  55 12 63 18 B0 EE BB 86 6E 5E 1A 4E D1 95 29 32  U.c.....n^.N..)2
0060:  18 02 1D 53 C5 DF 87 E0 82 65 57 A9 F8 3E 3F 5B  ...S.....eW..>?[
0070:  8A 1D 8B 68 BD 3A F4 34 DC F3 1F A0 05 86 4F 33  ...h.:.4......O3
0080:  E2 C4 48 05 0B EB 82 8D 24 8F 61 8C 8A 32 B0 E7  ..H.....$.a..2..
0090:  C0 22 29 16 92 3D 55 EF D6 BA E3 FB EF 05 C8 FE  .")..=U.........
00a0:  52 49 8D 2A 00 87 76 6B C3 FB 8C 5E 72 03 FD E0  RI.*..vk...^r...
00b0:  BD 1A 8C 00 18 7B 80 71 34 3F 08 A5 81 2E 6B 38  .....{.q4?....k8
00c0:  CB 13 8C 70 B8 64 E2 E9 F2 EE FF 2E 9B 6E 2B C1  ...p.d.......n+.
00d0:  2F 67 B3 E3 E0 F6 24 10 75 45 ED AD A2 67 C1 DE  /g....$.uE...g..
00e0:  7D 7B 12 C3 63 29 BF 94 6B 87 E4 07 00 AC C3 66  }{..c)..k......f
00f0:  98 C6 D6 5F 87 B0 B2 EC DB DB 05 F9 95 84 61 10  ..._..........a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  79 C2 41 2E CE 48 7A 16 2F E5 3F 82 03 01 00 01  y.A..Hz./.?.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B8 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 BA F4 09 8F B8 E5 EF  .I..............
0010:  D6 91 7D 7A 57 59 E9 51 BD 46 81 ED 20 A8 50 5F  ..}zWY.Q.F.. .P_
0020:  C1 23 11 DB 8C 24 0A 22 3E 3E 1A CD 0F C4 13 A9  .#...$.">>......
0030:  6A CA C1 52 17 61 2B 88 74 B5 2E 30 16 D4 95 9E  j..R.a+.t..0....
0040:  C2 73 02 5B 5D 44 37 F9 43 A3 D3 AE 4C 8C F5 1B  .s.[]D7.C...L...
0050:  4C F6 3B EE CC 4F 0A 36 FB F6 CB AB 84 83 05 A2  L.;..O.6........
0060:  5A 8E 91 46 61 EF 2B 1D F3 91 67 6F 34 17 6F 11  Z..Fa.+...go4.o.
0070:  3A 27 AA CF 0A FB E5 EE F2 BA 0D A9 E2 1D D6 5B  :'.............[
0080:  05 82 5D 4B C5 9E 33 88 D1 2B 3E 2C 86 EB E9 54  ..]K..3..+>,...T
0090:  CE 9E 55 CA 69 B5 5C 90 E1 EC 1C F8 47 D0 0B 4D  ..U.i.\.....G..M
00a0:  54 34 54 63 77 27 23 A5 00 5B 31 57 F0 EA 36 4C  T4Tcw'#..[1W..6L
00b0:  5E 2E A4 E5 D8 BD 4E B9 10 ED 7E 72 25 51 2F B1  ^.....N...~r%Q/.
00c0:  D7 B8 52 CA CA 09 11 A4 24 60 29 0E 7B 42 05 32  ..R.....$`).{B.2
00d0:  59 0E 7C F7 D7 AF 7F D6 B6 D3 8C EF F9 FE C9 55  Y.|............U
00e0:  2D 73 EA B4 72 06 6C CB E0 E1 9F 9F 59 15 23 50  -s..r.l.....Y.#P
00f0:  72 D1 81 E1 FA 84 AD 1C DD C0 FD BC DB AC 61 10  r.............a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  43 5C 52 58 B0 E9 B0 4E 1C 76 55 82 03 01 00 01  C\RX...N.vU.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 0C 06 D2 76 00 01 24 01                 ......v..$.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  12 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 D2 76 00 01 24 01 00              ......v..$..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 4F 10                                   ...O.

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D2 76 00 01 24 01 02 01 00 06 05 40 73 22 00 00  .v..$......@s"..
0010:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 6E 00                                   ...n.

Response 226 bytes: 90 00  [I] Command successfully executed (OK).
0000:  6E 81 DD 4F 10 D2 76 00 01 24 01 02 01 00 06 05  n..O..v..$......
0010:  40 73 22 00 00 5F 52 08 00 73 00 00 80 05 90 00  @s".._R..s......
0020:  7F 74 03 81 01 20 73 81 B7 C0 0A 3C 00 00 00 04  .t... s....<....
0030:  C0 00 FF 00 FF C1 06 01 08 00 00 11 00 C2 06 01  ................
0040:  08 00 00 11 00 C3 06 01 08 00 00 11 00 C4 07 FF  ................
0050:  7F 7F 7F 03 00 03 C5 3C A6 4E 2B FE A8 BA D3 07  .......<.N+.....
0060:  9C 09 B3 14 02 CF B3 52 E1 83 94 C7 0D C2 2E 61  .......R.......a
0070:  DA FE 3B 96 6E B6 47 9B 3F 83 51 39 14 B7 8B F8  ..;.n.G.?.Q9....
0080:  02 AB 9B 30 FC 63 B8 08 AB 19 1B 94 3C 9E D8 05  ...0.c......<...
0090:  C4 F6 A8 F7 C6 3C 00 00 00 00 00 00 00 00 00 00  .....<..........
00a0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00b0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00c0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00d0:  00 00 CD 0C 59 2E B8 8D 59 2E B8 8D 59 2E BA CF  ....Y...Y...Y...
00e0:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 5E 00                                   ...^.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 65 00                                   ...e.

Response 13 bytes: 90 00  [I] Command successfully executed (OK).
0000:  65 09 5B 00 5F 2D 00 5F 35 01 39 90 00           e.[._-._5.9..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 7A 00                                   ...z.

Response  9 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7A 05 93 03 00 00 00 90 00                       z........

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 01 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 02 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 03 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 04 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 5F 50 00                                   .._P.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 A4 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 A2 BF D6 7C F8 68 8B  .I..........|.h.
0010:  24 67 5C E1 56 B3 C3 D1 2A 9C 43 82 8F BA 64 2B  $g\.V...*.C...d+
0020:  55 40 0F DC BE 1E 42 31 CD B0 0D 62 58 F1 AE 83  U@....B1...bX...
0030:  9E 43 7F 41 08 F3 EA A4 98 BD 5E 43 68 44 A9 09  .C.A......^ChD..
0040:  93 BF 74 BB F9 67 6A 35 3D 89 AA CC D4 0F 55 24  ..t..gj5=.....U$
0050:  C8 05 D1 32 56 E6 A2 7D CA 77 2F CD AA 8A 30 15  ...2V..}.w/...0.
0060:  D9 C0 0C 88 5C FF 91 01 98 28 38 85 51 90 4A CB  ....\....(8.Q.J.
0070:  CB 62 C5 56 29 16 53 55 59 3F 66 AB 58 99 5E 92  .b.V).SUY?f.X.^.
0080:  8B 49 94 F0 A6 51 33 56 A6 B9 1B 7E 7B 5B 7C FA  .I...Q3V...~{[|.
0090:  07 28 24 E3 FC B6 1B 18 C0 62 B4 0B 44 46 47 DB  .($......b..DFG.
00a0:  BC D7 FD 09 36 6E F5 23 40 08 7B 35 1D 55 28 E7  ....6n.#@.{5.U(.
00b0:  44 41 A1 BF 21 3E 83 B0 26 5C BC 64 78 20 B1 C0  DA..!>..&\.dx ..
00c0:  86 81 B1 2F 00 BE 86 B4 16 AE D1 24 67 BC 59 E8  .../.......$g.Y.
00d0:  2A 29 F6 17 01 19 8E B1 B8 44 37 9F 99 8E B4 7F  *).......D7.....
00e0:  5B 7B 0A 10 C5 94 17 15 B8 7E F8 C2 88 05 B8 E1  [{.......~......
00f0:  E9 88 D6 29 E1 D7 2F 9D 23 D6 03 F0 0C A8 61 10  ...)../.#.....a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D3 6D CE EA 8A 5C EF 65 A8 0D 25 82 03 01 00 01  .m...\.e..%.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B6 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 E6 AA 79 0A D2 C2 D2  .I.........y....
0010:  E6 85 38 FF CC E9 08 0E 20 48 0D C1 4D E2 B7 A7  ..8..... H..M...
0020:  D1 DD 7E FD AE 71 3F 8D FE E5 F6 10 98 A9 59 2A  ..~..q?.......Y*
0030:  4E 60 88 81 20 26 3B 47 96 D9 96 52 0F 0F FC EA  N`.. &;G...R....
0040:  A7 00 8C CE 82 99 2B AD C8 F3 8D AD DC 09 8F 16  ......+.........
0050:  55 12 63 18 B0 EE BB 86 6E 5E 1A 4E D1 95 29 32  U.c.....n^.N..)2
0060:  18 02 1D 53 C5 DF 87 E0 82 65 57 A9 F8 3E 3F 5B  ...S.....eW..>?[
0070:  8A 1D 8B 68 BD 3A F4 34 DC F3 1F A0 05 86 4F 33  ...h.:.4......O3
0080:  E2 C4 48 05 0B EB 82 8D 24 8F 61 8C 8A 32 B0 E7  ..H.....$.a..2..
0090:  C0 22 29 16 92 3D 55 EF D6 BA E3 FB EF 05 C8 FE  .")..=U.........
00a0:  52 49 8D 2A 00 87 76 6B C3 FB 8C 5E 72 03 FD E0  RI.*..vk...^r...
00b0:  BD 1A 8C 00 18 7B 80 71 34 3F 08 A5 81 2E 6B 38  .....{.q4?....k8
00c0:  CB 13 8C 70 B8 64 E2 E9 F2 EE FF 2E 9B 6E 2B C1  ...p.d.......n+.
00d0:  2F 67 B3 E3 E0 F6 24 10 75 45 ED AD A2 67 C1 DE  /g....$.uE...g..
00e0:  7D 7B 12 C3 63 29 BF 94 6B 87 E4 07 00 AC C3 66  }{..c)..k......f
00f0:  98 C6 D6 5F 87 B0 B2 EC DB DB 05 F9 95 84 61 10  ..._..........a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  79 C2 41 2E CE 48 7A 16 2F E5 3F 82 03 01 00 01  y.A..Hz./.?.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B8 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 BA F4 09 8F B8 E5 EF  .I..............
0010:  D6 91 7D 7A 57 59 E9 51 BD 46 81 ED 20 A8 50 5F  ..}zWY.Q.F.. .P_
0020:  C1 23 11 DB 8C 24 0A 22 3E 3E 1A CD 0F C4 13 A9  .#...$.">>......
0030:  6A CA C1 52 17 61 2B 88 74 B5 2E 30 16 D4 95 9E  j..R.a+.t..0....
0040:  C2 73 02 5B 5D 44 37 F9 43 A3 D3 AE 4C 8C F5 1B  .s.[]D7.C...L...
0050:  4C F6 3B EE CC 4F 0A 36 FB F6 CB AB 84 83 05 A2  L.;..O.6........
0060:  5A 8E 91 46 61 EF 2B 1D F3 91 67 6F 34 17 6F 11  Z..Fa.+...go4.o.
0070:  3A 27 AA CF 0A FB E5 EE F2 BA 0D A9 E2 1D D6 5B  :'.............[
0080:  05 82 5D 4B C5 9E 33 88 D1 2B 3E 2C 86 EB E9 54  ..]K..3..+>,...T
0090:  CE 9E 55 CA 69 B5 5C 90 E1 EC 1C F8 47 D0 0B 4D  ..U.i.\.....G..M
00a0:  54 34 54 63 77 27 23 A5 00 5B 31 57 F0 EA 36 4C  T4Tcw'#..[1W..6L
00b0:  5E 2E A4 E5 D8 BD 4E B9 10 ED 7E 72 25 51 2F B1  ^.....N...~r%Q/.
00c0:  D7 B8 52 CA CA 09 11 A4 24 60 29 0E 7B 42 05 32  ..R.....$`).{B.2
00d0:  59 0E 7C F7 D7 AF 7F D6 B6 D3 8C EF F9 FE C9 55  Y.|............U
00e0:  2D 73 EA B4 72 06 6C CB E0 E1 9F 9F 59 15 23 50  -s..r.l.....Y.#P
00f0:  72 D1 81 E1 FA 84 AD 1C DD C0 FD BC DB AC 61 10  r.............a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  43 5C 52 58 B0 E9 B0 4E 1C 76 55 82 03 01 00 01  C\RX...N.vU.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 0C 06 D2 76 00 01 24 01                 ......v..$.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  12 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 D2 76 00 01 24 01 00              ......v..$..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 4F 10                                   ...O.

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D2 76 00 01 24 01 02 01 00 06 05 40 73 22 00 00  .v..$......@s"..
0010:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 6E 00                                   ...n.

Response 226 bytes: 90 00  [I] Command successfully executed (OK).
0000:  6E 81 DD 4F 10 D2 76 00 01 24 01 02 01 00 06 05  n..O..v..$......
0010:  40 73 22 00 00 5F 52 08 00 73 00 00 80 05 90 00  @s".._R..s......
0020:  7F 74 03 81 01 20 73 81 B7 C0 0A 3C 00 00 00 04  .t... s....<....
0030:  C0 00 FF 00 FF C1 06 01 08 00 00 11 00 C2 06 01  ................
0040:  08 00 00 11 00 C3 06 01 08 00 00 11 00 C4 07 FF  ................
0050:  7F 7F 7F 03 00 03 C5 3C A6 4E 2B FE A8 BA D3 07  .......<.N+.....
0060:  9C 09 B3 14 02 CF B3 52 E1 83 94 C7 0D C2 2E 61  .......R.......a
0070:  DA FE 3B 96 6E B6 47 9B 3F 83 51 39 14 B7 8B F8  ..;.n.G.?.Q9....
0080:  02 AB 9B 30 FC 63 B8 08 AB 19 1B 94 3C 9E D8 05  ...0.c......<...
0090:  C4 F6 A8 F7 C6 3C 00 00 00 00 00 00 00 00 00 00  .....<..........
00a0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00b0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00c0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00d0:  00 00 CD 0C 59 2E B8 8D 59 2E B8 8D 59 2E BA CF  ....Y...Y...Y...
00e0:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 5E 00                                   ...^.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 65 00                                   ...e.

Response 13 bytes: 90 00  [I] Command successfully executed (OK).
0000:  65 09 5B 00 5F 2D 00 5F 35 01 39 90 00           e.[._-._5.9..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 7A 00                                   ...z.

Response  9 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7A 05 93 03 00 00 00 90 00                       z........

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 01 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 02 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 03 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 04 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 5F 50 00                                   .._P.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 A4 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 A2 BF D6 7C F8 68 8B  .I..........|.h.
0010:  24 67 5C E1 56 B3 C3 D1 2A 9C 43 82 8F BA 64 2B  $g\.V...*.C...d+
0020:  55 40 0F DC BE 1E 42 31 CD B0 0D 62 58 F1 AE 83  U@....B1...bX...
0030:  9E 43 7F 41 08 F3 EA A4 98 BD 5E 43 68 44 A9 09  .C.A......^ChD..
0040:  93 BF 74 BB F9 67 6A 35 3D 89 AA CC D4 0F 55 24  ..t..gj5=.....U$
0050:  C8 05 D1 32 56 E6 A2 7D CA 77 2F CD AA 8A 30 15  ...2V..}.w/...0.
0060:  D9 C0 0C 88 5C FF 91 01 98 28 38 85 51 90 4A CB  ....\....(8.Q.J.
0070:  CB 62 C5 56 29 16 53 55 59 3F 66 AB 58 99 5E 92  .b.V).SUY?f.X.^.
0080:  8B 49 94 F0 A6 51 33 56 A6 B9 1B 7E 7B 5B 7C FA  .I...Q3V...~{[|.
0090:  07 28 24 E3 FC B6 1B 18 C0 62 B4 0B 44 46 47 DB  .($......b..DFG.
00a0:  BC D7 FD 09 36 6E F5 23 40 08 7B 35 1D 55 28 E7  ....6n.#@.{5.U(.
00b0:  44 41 A1 BF 21 3E 83 B0 26 5C BC 64 78 20 B1 C0  DA..!>..&\.dx ..
00c0:  86 81 B1 2F 00 BE 86 B4 16 AE D1 24 67 BC 59 E8  .../.......$g.Y.
00d0:  2A 29 F6 17 01 19 8E B1 B8 44 37 9F 99 8E B4 7F  *).......D7.....
00e0:  5B 7B 0A 10 C5 94 17 15 B8 7E F8 C2 88 05 B8 E1  [{.......~......
00f0:  E9 88 D6 29 E1 D7 2F 9D 23 D6 03 F0 0C A8 61 10  ...)../.#.....a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D3 6D CE EA 8A 5C EF 65 A8 0D 25 82 03 01 00 01  .m...\.e..%.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B6 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 E6 AA 79 0A D2 C2 D2  .I.........y....
0010:  E6 85 38 FF CC E9 08 0E 20 48 0D C1 4D E2 B7 A7  ..8..... H..M...
0020:  D1 DD 7E FD AE 71 3F 8D FE E5 F6 10 98 A9 59 2A  ..~..q?.......Y*
0030:  4E 60 88 81 20 26 3B 47 96 D9 96 52 0F 0F FC EA  N`.. &;G...R....
0040:  A7 00 8C CE 82 99 2B AD C8 F3 8D AD DC 09 8F 16  ......+.........
0050:  55 12 63 18 B0 EE BB 86 6E 5E 1A 4E D1 95 29 32  U.c.....n^.N..)2
0060:  18 02 1D 53 C5 DF 87 E0 82 65 57 A9 F8 3E 3F 5B  ...S.....eW..>?[
0070:  8A 1D 8B 68 BD 3A F4 34 DC F3 1F A0 05 86 4F 33  ...h.:.4......O3
0080:  E2 C4 48 05 0B EB 82 8D 24 8F 61 8C 8A 32 B0 E7  ..H.....$.a..2..
0090:  C0 22 29 16 92 3D 55 EF D6 BA E3 FB EF 05 C8 FE  .")..=U.........
00a0:  52 49 8D 2A 00 87 76 6B C3 FB 8C 5E 72 03 FD E0  RI.*..vk...^r...
00b0:  BD 1A 8C 00 18 7B 80 71 34 3F 08 A5 81 2E 6B 38  .....{.q4?....k8
00c0:  CB 13 8C 70 B8 64 E2 E9 F2 EE FF 2E 9B 6E 2B C1  ...p.d.......n+.
00d0:  2F 67 B3 E3 E0 F6 24 10 75 45 ED AD A2 67 C1 DE  /g....$.uE...g..
00e0:  7D 7B 12 C3 63 29 BF 94 6B 87 E4 07 00 AC C3 66  }{..c)..k......f
00f0:  98 C6 D6 5F 87 B0 B2 EC DB DB 05 F9 95 84 61 10  ..._..........a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  79 C2 41 2E CE 48 7A 16 2F E5 3F 82 03 01 00 01  y.A..Hz./.?.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B8 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 BA F4 09 8F B8 E5 EF  .I..............
0010:  D6 91 7D 7A 57 59 E9 51 BD 46 81 ED 20 A8 50 5F  ..}zWY.Q.F.. .P_
0020:  C1 23 11 DB 8C 24 0A 22 3E 3E 1A CD 0F C4 13 A9  .#...$.">>......
0030:  6A CA C1 52 17 61 2B 88 74 B5 2E 30 16 D4 95 9E  j..R.a+.t..0....
0040:  C2 73 02 5B 5D 44 37 F9 43 A3 D3 AE 4C 8C F5 1B  .s.[]D7.C...L...
0050:  4C F6 3B EE CC 4F 0A 36 FB F6 CB AB 84 83 05 A2  L.;..O.6........
0060:  5A 8E 91 46 61 EF 2B 1D F3 91 67 6F 34 17 6F 11  Z..Fa.+...go4.o.
0070:  3A 27 AA CF 0A FB E5 EE F2 BA 0D A9 E2 1D D6 5B  :'.............[
0080:  05 82 5D 4B C5 9E 33 88 D1 2B 3E 2C 86 EB E9 54  ..]K..3..+>,...T
0090:  CE 9E 55 CA 69 B5 5C 90 E1 EC 1C F8 47 D0 0B 4D  ..U.i.\.....G..M
00a0:  54 34 54 63 77 27 23 A5 00 5B 31 57 F0 EA 36 4C  T4Tcw'#..[1W..6L
00b0:  5E 2E A4 E5 D8 BD 4E B9 10 ED 7E 72 25 51 2F B1  ^.....N...~r%Q/.
00c0:  D7 B8 52 CA CA 09 11 A4 24 60 29 0E 7B 42 05 32  ..R.....$`).{B.2
00d0:  59 0E 7C F7 D7 AF 7F D6 B6 D3 8C EF F9 FE C9 55  Y.|............U
00e0:  2D 73 EA B4 72 06 6C CB E0 E1 9F 9F 59 15 23 50  -s..r.l.....Y.#P
00f0:  72 D1 81 E1 FA 84 AD 1C DD C0 FD BC DB AC 61 10  r.............a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  43 5C 52 58 B0 E9 B0 4E 1C 76 55 82 03 01 00 01  C\RX...N.vU.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 0C 06 D2 76 00 01 24 01                 ......v..$.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  12 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 D2 76 00 01 24 01 00              ......v..$..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 4F 10                                   ...O.

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D2 76 00 01 24 01 02 01 00 06 05 40 73 22 00 00  .v..$......@s"..
0010:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 6E 00                                   ...n.

Response 226 bytes: 90 00  [I] Command successfully executed (OK).
0000:  6E 81 DD 4F 10 D2 76 00 01 24 01 02 01 00 06 05  n..O..v..$......
0010:  40 73 22 00 00 5F 52 08 00 73 00 00 80 05 90 00  @s".._R..s......
0020:  7F 74 03 81 01 20 73 81 B7 C0 0A 3C 00 00 00 04  .t... s....<....
0030:  C0 00 FF 00 FF C1 06 01 08 00 00 11 00 C2 06 01  ................
0040:  08 00 00 11 00 C3 06 01 08 00 00 11 00 C4 07 FF  ................
0050:  7F 7F 7F 03 00 03 C5 3C A6 4E 2B FE A8 BA D3 07  .......<.N+.....
0060:  9C 09 B3 14 02 CF B3 52 E1 83 94 C7 0D C2 2E 61  .......R.......a
0070:  DA FE 3B 96 6E B6 47 9B 3F 83 51 39 14 B7 8B F8  ..;.n.G.?.Q9....
0080:  02 AB 9B 30 FC 63 B8 08 AB 19 1B 94 3C 9E D8 05  ...0.c......<...
0090:  C4 F6 A8 F7 C6 3C 00 00 00 00 00 00 00 00 00 00  .....<..........
00a0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00b0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00c0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00d0:  00 00 CD 0C 59 2E B8 8D 59 2E B8 8D 59 2E BA CF  ....Y...Y...Y...
00e0:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 5E 00                                   ...^.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 65 00                                   ...e.

Response 13 bytes: 90 00  [I] Command successfully executed (OK).
0000:  65 09 5B 00 5F 2D 00 5F 35 01 39 90 00           e.[._-._5.9..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 7A 00                                   ...z.

Response  9 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7A 05 93 03 00 00 00 90 00                       z........

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 01 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 02 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 03 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 04 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 5F 50 00                                   .._P.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 A4 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 A2 BF D6 7C F8 68 8B  .I..........|.h.
0010:  24 67 5C E1 56 B3 C3 D1 2A 9C 43 82 8F BA 64 2B  $g\.V...*.C...d+
0020:  55 40 0F DC BE 1E 42 31 CD B0 0D 62 58 F1 AE 83  U@....B1...bX...
0030:  9E 43 7F 41 08 F3 EA A4 98 BD 5E 43 68 44 A9 09  .C.A......^ChD..
0040:  93 BF 74 BB F9 67 6A 35 3D 89 AA CC D4 0F 55 24  ..t..gj5=.....U$
0050:  C8 05 D1 32 56 E6 A2 7D CA 77 2F CD AA 8A 30 15  ...2V..}.w/...0.
0060:  D9 C0 0C 88 5C FF 91 01 98 28 38 85 51 90 4A CB  ....\....(8.Q.J.
0070:  CB 62 C5 56 29 16 53 55 59 3F 66 AB 58 99 5E 92  .b.V).SUY?f.X.^.
0080:  8B 49 94 F0 A6 51 33 56 A6 B9 1B 7E 7B 5B 7C FA  .I...Q3V...~{[|.
0090:  07 28 24 E3 FC B6 1B 18 C0 62 B4 0B 44 46 47 DB  .($......b..DFG.
00a0:  BC D7 FD 09 36 6E F5 23 40 08 7B 35 1D 55 28 E7  ....6n.#@.{5.U(.
00b0:  44 41 A1 BF 21 3E 83 B0 26 5C BC 64 78 20 B1 C0  DA..!>..&\.dx ..
00c0:  86 81 B1 2F 00 BE 86 B4 16 AE D1 24 67 BC 59 E8  .../.......$g.Y.
00d0:  2A 29 F6 17 01 19 8E B1 B8 44 37 9F 99 8E B4 7F  *).......D7.....
00e0:  5B 7B 0A 10 C5 94 17 15 B8 7E F8 C2 88 05 B8 E1  [{.......~......
00f0:  E9 88 D6 29 E1 D7 2F 9D 23 D6 03 F0 0C A8 61 10  ...)../.#.....a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D3 6D CE EA 8A 5C EF 65 A8 0D 25 82 03 01 00 01  .m...\.e..%.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B6 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 E6 AA 79 0A D2 C2 D2  .I.........y....
0010:  E6 85 38 FF CC E9 08 0E 20 48 0D C1 4D E2 B7 A7  ..8..... H..M...
0020:  D1 DD 7E FD AE 71 3F 8D FE E5 F6 10 98 A9 59 2A  ..~..q?.......Y*
0030:  4E 60 88 81 20 26 3B 47 96 D9 96 52 0F 0F FC EA  N`.. &;G...R....
0040:  A7 00 8C CE 82 99 2B AD C8 F3 8D AD DC 09 8F 16  ......+.........
0050:  55 12 63 18 B0 EE BB 86 6E 5E 1A 4E D1 95 29 32  U.c.....n^.N..)2
0060:  18 02 1D 53 C5 DF 87 E0 82 65 57 A9 F8 3E 3F 5B  ...S.....eW..>?[
0070:  8A 1D 8B 68 BD 3A F4 34 DC F3 1F A0 05 86 4F 33  ...h.:.4......O3
0080:  E2 C4 48 05 0B EB 82 8D 24 8F 61 8C 8A 32 B0 E7  ..H.....$.a..2..
0090:  C0 22 29 16 92 3D 55 EF D6 BA E3 FB EF 05 C8 FE  .")..=U.........
00a0:  52 49 8D 2A 00 87 76 6B C3 FB 8C 5E 72 03 FD E0  RI.*..vk...^r...
00b0:  BD 1A 8C 00 18 7B 80 71 34 3F 08 A5 81 2E 6B 38  .....{.q4?....k8
00c0:  CB 13 8C 70 B8 64 E2 E9 F2 EE FF 2E 9B 6E 2B C1  ...p.d.......n+.
00d0:  2F 67 B3 E3 E0 F6 24 10 75 45 ED AD A2 67 C1 DE  /g....$.uE...g..
00e0:  7D 7B 12 C3 63 29 BF 94 6B 87 E4 07 00 AC C3 66  }{..c)..k......f
00f0:  98 C6 D6 5F 87 B0 B2 EC DB DB 05 F9 95 84 61 10  ..._..........a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  79 C2 41 2E CE 48 7A 16 2F E5 3F 82 03 01 00 01  y.A..Hz./.?.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B8 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 BA F4 09 8F B8 E5 EF  .I..............
0010:  D6 91 7D 7A 57 59 E9 51 BD 46 81 ED 20 A8 50 5F  ..}zWY.Q.F.. .P_
0020:  C1 23 11 DB 8C 24 0A 22 3E 3E 1A CD 0F C4 13 A9  .#...$.">>......
0030:  6A CA C1 52 17 61 2B 88 74 B5 2E 30 16 D4 95 9E  j..R.a+.t..0....
0040:  C2 73 02 5B 5D 44 37 F9 43 A3 D3 AE 4C 8C F5 1B  .s.[]D7.C...L...
0050:  4C F6 3B EE CC 4F 0A 36 FB F6 CB AB 84 83 05 A2  L.;..O.6........
0060:  5A 8E 91 46 61 EF 2B 1D F3 91 67 6F 34 17 6F 11  Z..Fa.+...go4.o.
0070:  3A 27 AA CF 0A FB E5 EE F2 BA 0D A9 E2 1D D6 5B  :'.............[
0080:  05 82 5D 4B C5 9E 33 88 D1 2B 3E 2C 86 EB E9 54  ..]K..3..+>,...T
0090:  CE 9E 55 CA 69 B5 5C 90 E1 EC 1C F8 47 D0 0B 4D  ..U.i.\.....G..M
00a0:  54 34 54 63 77 27 23 A5 00 5B 31 57 F0 EA 36 4C  T4Tcw'#..[1W..6L
00b0:  5E 2E A4 E5 D8 BD 4E B9 10 ED 7E 72 25 51 2F B1  ^.....N...~r%Q/.
00c0:  D7 B8 52 CA CA 09 11 A4 24 60 29 0E 7B 42 05 32  ..R.....$`).{B.2
00d0:  59 0E 7C F7 D7 AF 7F D6 B6 D3 8C EF F9 FE C9 55  Y.|............U
00e0:  2D 73 EA B4 72 06 6C CB E0 E1 9F 9F 59 15 23 50  -s..r.l.....Y.#P
00f0:  72 D1 81 E1 FA 84 AD 1C DD C0 FD BC DB AC 61 10  r.............a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  43 5C 52 58 B0 E9 B0 4E 1C 76 55 82 03 01 00 01  C\RX...N.vU.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 0C 06 D2 76 00 01 24 01                 ......v..$.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  12 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 D2 76 00 01 24 01 00              ......v..$..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 4F 10                                   ...O.

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D2 76 00 01 24 01 02 01 00 06 05 40 73 22 00 00  .v..$......@s"..
0010:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 6E 00                                   ...n.

Response 226 bytes: 90 00  [I] Command successfully executed (OK).
0000:  6E 81 DD 4F 10 D2 76 00 01 24 01 02 01 00 06 05  n..O..v..$......
0010:  40 73 22 00 00 5F 52 08 00 73 00 00 80 05 90 00  @s".._R..s......
0020:  7F 74 03 81 01 20 73 81 B7 C0 0A 3C 00 00 00 04  .t... s....<....
0030:  C0 00 FF 00 FF C1 06 01 08 00 00 11 00 C2 06 01  ................
0040:  08 00 00 11 00 C3 06 01 08 00 00 11 00 C4 07 FF  ................
0050:  7F 7F 7F 03 00 03 C5 3C A6 4E 2B FE A8 BA D3 07  .......<.N+.....
0060:  9C 09 B3 14 02 CF B3 52 E1 83 94 C7 0D C2 2E 61  .......R.......a
0070:  DA FE 3B 96 6E B6 47 9B 3F 83 51 39 14 B7 8B F8  ..;.n.G.?.Q9....
0080:  02 AB 9B 30 FC 63 B8 08 AB 19 1B 94 3C 9E D8 05  ...0.c......<...
0090:  C4 F6 A8 F7 C6 3C 00 00 00 00 00 00 00 00 00 00  .....<..........
00a0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00b0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00c0:  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  ................
00d0:  00 00 CD 0C 59 2E B8 8D 59 2E B8 8D 59 2E BA CF  ....Y...Y...Y...
00e0:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 5E 00                                   ...^.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 65 00                                   ...e.

Response 13 bytes: 90 00  [I] Command successfully executed (OK).
0000:  65 09 5B 00 5F 2D 00 5F 35 01 39 90 00           e.[._-._5.9..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 00 7A 00                                   ...z.

Response  9 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7A 05 93 03 00 00 00 90 00                       z........

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 01 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 02 00                                   .....

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 03 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 01 04 00                                   .....

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA 5F 50 00                                   .._P.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 A4 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 A2 BF D6 7C F8 68 8B  .I..........|.h.
0010:  24 67 5C E1 56 B3 C3 D1 2A 9C 43 82 8F BA 64 2B  $g\.V...*.C...d+
0020:  55 40 0F DC BE 1E 42 31 CD B0 0D 62 58 F1 AE 83  U@....B1...bX...
0030:  9E 43 7F 41 08 F3 EA A4 98 BD 5E 43 68 44 A9 09  .C.A......^ChD..
0040:  93 BF 74 BB F9 67 6A 35 3D 89 AA CC D4 0F 55 24  ..t..gj5=.....U$
0050:  C8 05 D1 32 56 E6 A2 7D CA 77 2F CD AA 8A 30 15  ...2V..}.w/...0.
0060:  D9 C0 0C 88 5C FF 91 01 98 28 38 85 51 90 4A CB  ....\....(8.Q.J.
0070:  CB 62 C5 56 29 16 53 55 59 3F 66 AB 58 99 5E 92  .b.V).SUY?f.X.^.
0080:  8B 49 94 F0 A6 51 33 56 A6 B9 1B 7E 7B 5B 7C FA  .I...Q3V...~{[|.
0090:  07 28 24 E3 FC B6 1B 18 C0 62 B4 0B 44 46 47 DB  .($......b..DFG.
00a0:  BC D7 FD 09 36 6E F5 23 40 08 7B 35 1D 55 28 E7  ....6n.#@.{5.U(.
00b0:  44 41 A1 BF 21 3E 83 B0 26 5C BC 64 78 20 B1 C0  DA..!>..&\.dx ..
00c0:  86 81 B1 2F 00 BE 86 B4 16 AE D1 24 67 BC 59 E8  .../.......$g.Y.
00d0:  2A 29 F6 17 01 19 8E B1 B8 44 37 9F 99 8E B4 7F  *).......D7.....
00e0:  5B 7B 0A 10 C5 94 17 15 B8 7E F8 C2 88 05 B8 E1  [{.......~......
00f0:  E9 88 D6 29 E1 D7 2F 9D 23 D6 03 F0 0C A8 61 10  ...)../.#.....a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  D3 6D CE EA 8A 5C EF 65 A8 0D 25 82 03 01 00 01  .m...\.e..%.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B6 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 E6 AA 79 0A D2 C2 D2  .I.........y....
0010:  E6 85 38 FF CC E9 08 0E 20 48 0D C1 4D E2 B7 A7  ..8..... H..M...
0020:  D1 DD 7E FD AE 71 3F 8D FE E5 F6 10 98 A9 59 2A  ..~..q?.......Y*
0030:  4E 60 88 81 20 26 3B 47 96 D9 96 52 0F 0F FC EA  N`.. &;G...R....
0040:  A7 00 8C CE 82 99 2B AD C8 F3 8D AD DC 09 8F 16  ......+.........
0050:  55 12 63 18 B0 EE BB 86 6E 5E 1A 4E D1 95 29 32  U.c.....n^.N..)2
0060:  18 02 1D 53 C5 DF 87 E0 82 65 57 A9 F8 3E 3F 5B  ...S.....eW..>?[
0070:  8A 1D 8B 68 BD 3A F4 34 DC F3 1F A0 05 86 4F 33  ...h.:.4......O3
0080:  E2 C4 48 05 0B EB 82 8D 24 8F 61 8C 8A 32 B0 E7  ..H.....$.a..2..
0090:  C0 22 29 16 92 3D 55 EF D6 BA E3 FB EF 05 C8 FE  .")..=U.........
00a0:  52 49 8D 2A 00 87 76 6B C3 FB 8C 5E 72 03 FD E0  RI.*..vk...^r...
00b0:  BD 1A 8C 00 18 7B 80 71 34 3F 08 A5 81 2E 6B 38  .....{.q4?....k8
00c0:  CB 13 8C 70 B8 64 E2 E9 F2 EE FF 2E 9B 6E 2B C1  ...p.d.......n+.
00d0:  2F 67 B3 E3 E0 F6 24 10 75 45 ED AD A2 67 C1 DE  /g....$.uE...g..
00e0:  7D 7B 12 C3 63 29 BF 94 6B 87 E4 07 00 AC C3 66  }{..c)..k......f
00f0:  98 C6 D6 5F 87 B0 B2 EC DB DB 05 F9 95 84 61 10  ..._..........a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  79 C2 41 2E CE 48 7A 16 2F E5 3F 82 03 01 00 01  y.A..Hz./.?.....
0010:  90 00                                            ..

Command   8 bytes: 47     GENERATE ASYMMETRIC KEY PAIR x
0000:  00 47 81 00 02 B8 00 00                          .G......

Response 256 bytes: 61 10  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7F 49 82 01 09 81 82 01 00 BA F4 09 8F B8 E5 EF  .I..............
0010:  D6 91 7D 7A 57 59 E9 51 BD 46 81 ED 20 A8 50 5F  ..}zWY.Q.F.. .P_
0020:  C1 23 11 DB 8C 24 0A 22 3E 3E 1A CD 0F C4 13 A9  .#...$.">>......
0030:  6A CA C1 52 17 61 2B 88 74 B5 2E 30 16 D4 95 9E  j..R.a+.t..0....
0040:  C2 73 02 5B 5D 44 37 F9 43 A3 D3 AE 4C 8C F5 1B  .s.[]D7.C...L...
0050:  4C F6 3B EE CC 4F 0A 36 FB F6 CB AB 84 83 05 A2  L.;..O.6........
0060:  5A 8E 91 46 61 EF 2B 1D F3 91 67 6F 34 17 6F 11  Z..Fa.+...go4.o.
0070:  3A 27 AA CF 0A FB E5 EE F2 BA 0D A9 E2 1D D6 5B  :'.............[
0080:  05 82 5D 4B C5 9E 33 88 D1 2B 3E 2C 86 EB E9 54  ..]K..3..+>,...T
0090:  CE 9E 55 CA 69 B5 5C 90 E1 EC 1C F8 47 D0 0B 4D  ..U.i.\.....G..M
00a0:  54 34 54 63 77 27 23 A5 00 5B 31 57 F0 EA 36 4C  T4Tcw'#..[1W..6L
00b0:  5E 2E A4 E5 D8 BD 4E B9 10 ED 7E 72 25 51 2F B1  ^.....N...~r%Q/.
00c0:  D7 B8 52 CA CA 09 11 A4 24 60 29 0E 7B 42 05 32  ..R.....$`).{B.2
00d0:  59 0E 7C F7 D7 AF 7F D6 B6 D3 8C EF F9 FE C9 55  Y.|............U
00e0:  2D 73 EA B4 72 06 6C CB E0 E1 9F 9F 59 15 23 50  -s..r.l.....Y.#P
00f0:  72 D1 81 E1 FA 84 AD 1C DD C0 FD BC DB AC 61 10  r.............a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 10                                   .....

Response 18 bytes: 90 00  [I] Command successfully executed (OK).
0000:  43 5C 52 58 B0 E9 B0 4E 1C 76 55 82 03 01 00 01  C\RX...N.vU.....
0010:  90 00                                            ..
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.
Reset
Power Down
