Connected to card in 'Yubico Yubikey 4 OTP+U2F+CCID 00 00'
Connected to virtual PCD at localhost:35963
Power Up
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 5E  .....|.........^
0010:  EE 44 13 5C 84 2E 69 06 88 75 1F 49 99 24 2C B3  .D.\..i..u.I.$,.
0020:  7A 0B 55 F4 FA B9 85 C6 E4 8C D7 61 BD 38 FA 56  z.U........a.8.V
0030:  A9 40 15 09 35 4A 9D 42 24 5D 21 47 0F 60 17 69  .@..5J.B$]!G.`.i
0040:  E0 55 22 5B 88 F1 BB B3 48 7F 9F 84 B9 C1 D0 0C  .U"[....H.......
0050:  32 65 62 CF 37 68 F2 E2 A2 84 0D 82 4B D9 5A 94  2eb.7h......K.Z.
0060:  FF 9A 6D 51 48 94 EA EF CB 43 F4 F4 5D 7D 71 0B  ..mQH....C..]}q.
0070:  EA 0B AD 16 41 90 02 D4 C5 B9 87 F3 E1 A1 7C BC  ....A.........|.
0080:  6B 4E 57 36 CD 65 C0 A2 67 09 58 D1 11 6E 4D 98  kNW6.e..g.X..nM.
0090:  77 C6 38 C2 D7 5E 9C 4D 7F 83 E2 60 54 ED D6 1C  w.8..^.M...`T...
00a0:  F5 56 FC 86 06 8A 58 15 C6 15 C1 AE A9 98 4C C8  .V....X.......L.
00b0:  B4 F5 53 F1 B4 B4 BA F3 DD 27 0A 4F 7F B6 38 A6  ..S......'.O..8.
00c0:  99 7F FC 7E 68 69 E8 80 EF B0 A6 BB 94 B1 52 5A  ...~hi........RZ
00d0:  6F 0C 87 98 39 0B C7 8F 45 02 E8 7E 87 D2 CF FF  o...9...E..~....
00e0:  14 8A E6 91 7B 17 C2 2B 4F C3 C2 49 A5 08 7A DB  ....{..+O..I..z.
00f0:  82 F7 49 59 9D AA EB B8 2E 8A D2 04 FB 52 01 70  ..IY.........R.p
0100:  62 8C DD 74                                      b..t

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  17 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 36 16 E0 29 27 9C 00 83 C6 D9 8A  .....6..)'......
0010:  00                                               .

Response 240 bytes: 61 1A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 8C 0A C8 A2 27 FD B1 FA  |...........'...
0010:  A9 64 86 1B 13 D2 C2 B2 D8 F3 66 C5 52 3F 39 24  .d........f.R?9$
0020:  FB D0 DB DE 8F 77 BB EF 54 D8 3E 91 76 60 84 20  .....w..T.>.v`. 
0030:  1F 5C 62 6C 09 E5 A4 1B 0C 75 A6 56 87 B5 81 C7  .\bl.....u.V....
0040:  9B DD 9D D2 89 3E 9E AC D6 AF 50 70 1E 4B CA 29  .....>....Pp.K.)
0050:  7E 7B 6A 4B 4F D4 B2 5A 8F F4 76 27 BB AE CE 54  ~{jKO..Z..v'...T
0060:  F0 8E 50 FC D1 E5 FD E9 AA 4C 42 6D CC D8 34 64  ..P......LBm..4d
0070:  C5 20 5F EA 0C A4 2E F0 23 08 51 6A D5 FE 85 B6  . _.....#.Qj....
0080:  52 C3 1F C1 BC C0 D8 93 9E 44 CC 86 54 0F 56 87  R........D..T.V.
0090:  96 EB 92 EE 43 5C AC D7 2B E4 9E F8 C2 60 5C 6F  ....C\..+....`\o
00a0:  67 12 FC AC 54 B1 E0 51 CD ED 2A 42 6F 1C 0A BD  g...T..Q..*Bo...
00b0:  58 CE 46 20 0E 01 4C C3 F5 08 2A 7C 90 05 43 F6  X.F ..L...*|..C.
00c0:  97 52 E1 2C E1 66 4E 21 93 14 1C BE F0 B8 38 57  .R.,.fN!......8W
00d0:  7E 9F EA 84 E3 64 92 18 17 69 8A E1 5B AD 95 63  ~....d...i..[..c
00e0:  ED AD C1 E3 63 2C A4 10 A6 BD 45 6F 14 55 61 1A  ....c,....Eo.Ua.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 1A                                   .....

Response 28 bytes: 90 00  [I] Command successfully executed (OK).
0000:  FE A7 33 51 E2 60 7B 4D 95 EF 8E D0 19 6A 08 32  ..3Q.`{M.....j.2
0010:  A8 50 40 65 1B 3D 60 ED B8 F1 90 00              .P@e.=`.....
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command   4 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80                                      . ..

Response  2 bytes: 63 C3  [W] Verify fail, 3 tries left.
0000:  63 C3                                            c.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 5E  .....|.........^
0010:  EE 44 13 5C 84 2E 69 06 88 75 1F 49 99 24 2C B3  .D.\..i..u.I.$,.
0020:  7A 0B 55 F4 FA B9 85 C6 E4 8C D7 61 BD 38 FA 56  z.U........a.8.V
0030:  A9 40 15 09 35 4A 9D 42 24 5D 21 47 0F 60 17 69  .@..5J.B$]!G.`.i
0040:  E0 55 22 5B 88 F1 BB B3 48 7F 9F 84 B9 C1 D0 0C  .U"[....H.......
0050:  32 65 62 CF 37 68 F2 E2 A2 84 0D 82 4B D9 5A 94  2eb.7h......K.Z.
0060:  FF 9A 6D 51 48 94 EA EF CB 43 F4 F4 5D 7D 71 0B  ..mQH....C..]}q.
0070:  EA 0B AD 16 41 90 02 D4 C5 B9 87 F3 E1 A1 7C BC  ....A.........|.
0080:  6B 4E 57 36 CD 65 C0 A2 67 09 58 D1 11 6E 4D 98  kNW6.e..g.X..nM.
0090:  77 C6 38 C2 D7 5E 9C 4D 7F 83 E2 60 54 ED D6 1C  w.8..^.M...`T...
00a0:  F5 56 FC 86 06 8A 58 15 C6 15 C1 AE A9 98 4C C8  .V....X.......L.
00b0:  B4 F5 53 F1 B4 B4 BA F3 DD 27 0A 4F 7F B6 38 A6  ..S......'.O..8.
00c0:  99 7F FC 7E 68 69 E8 80 EF B0 A6 BB 94 B1 52 5A  ...~hi........RZ
00d0:  6F 0C 87 98 39 0B C7 8F 45 02 E8 7E 87 D2 CF FF  o...9...E..~....
00e0:  14 8A E6 91 7B 17 C2 2B 4F C3 C2 49 A5 08 7A DB  ....{..+O..I..z.
00f0:  82 F7 49 59 9D AA EB B8 2E 8A D2 04 FB 52 01 70  ..IY.........R.p
0100:  62 8C DD 74                                      b..t

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  17 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 36 16 E0 29 27 9C 00 83 C6 D9 8A  .....6..)'......
0010:  00                                               .

Response 240 bytes: 61 1A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 8C 0A C8 A2 27 FD B1 FA  |...........'...
0010:  A9 64 86 1B 13 D2 C2 B2 D8 F3 66 C5 52 3F 39 24  .d........f.R?9$
0020:  FB D0 DB DE 8F 77 BB EF 54 D8 3E 91 76 60 84 20  .....w..T.>.v`. 
0030:  1F 5C 62 6C 09 E5 A4 1B 0C 75 A6 56 87 B5 81 C7  .\bl.....u.V....
0040:  9B DD 9D D2 89 3E 9E AC D6 AF 50 70 1E 4B CA 29  .....>....Pp.K.)
0050:  7E 7B 6A 4B 4F D4 B2 5A 8F F4 76 27 BB AE CE 54  ~{jKO..Z..v'...T
0060:  F0 8E 50 FC D1 E5 FD E9 AA 4C 42 6D CC D8 34 64  ..P......LBm..4d
0070:  C5 20 5F EA 0C A4 2E F0 23 08 51 6A D5 FE 85 B6  . _.....#.Qj....
0080:  52 C3 1F C1 BC C0 D8 93 9E 44 CC 86 54 0F 56 87  R........D..T.V.
0090:  96 EB 92 EE 43 5C AC D7 2B E4 9E F8 C2 60 5C 6F  ....C\..+....`\o
00a0:  67 12 FC AC 54 B1 E0 51 CD ED 2A 42 6F 1C 0A BD  g...T..Q..*Bo...
00b0:  58 CE 46 20 0E 01 4C C3 F5 08 2A 7C 90 05 43 F6  X.F ..L...*|..C.
00c0:  97 52 E1 2C E1 66 4E 21 93 14 1C BE F0 B8 38 57  .R.,.fN!......8W
00d0:  7E 9F EA 84 E3 64 92 18 17 69 8A E1 5B AD 95 63  ~....d...i..[..c
00e0:  ED AD C1 E3 63 2C A4 10 A6 BD 45 6F 14 55 61 1A  ....c,....Eo.Ua.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 1A                                   .....

Response 28 bytes: 90 00  [I] Command successfully executed (OK).
0000:  FE A7 33 51 E2 60 7B 4D 95 EF 8E D0 19 6A 08 32  ..3Q.`{M.....j.2
0010:  A8 50 40 65 1B 3D 60 ED B8 F1 90 00              .P@e.=`.....
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 07 08                 ..?..\._...

Response 10 bytes: 61 2D  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 33 F0 15 A0 00 00 01 61 2D                    S3......a-

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 07 35                 ..?..\._..5

Response 55 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 33 F0 15 A0 00 00 01 16 FF 02 02 13 96 24 81  S3............$.
0010:  B4 51 41 F2 11 83 34 F4 FA F1 01 21 F2 01 21 F3  .QA...4....!..!.
0020:  00 F4 01 00 F5 01 10 F6 00 F7 00 FA 00 FB 00 FC  ................
0030:  00 FD 00 FE 00 90 00                             .......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 06 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 21 08                 ..?..\._.!.

Response  2 bytes: 69 82  [E] Security condition not satisfied.
0000:  69 82                                            i.
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 5E  .....|.........^
0010:  EE 44 13 5C 84 2E 69 06 88 75 1F 49 99 24 2C B3  .D.\..i..u.I.$,.
0020:  7A 0B 55 F4 FA B9 85 C6 E4 8C D7 61 BD 38 FA 56  z.U........a.8.V
0030:  A9 40 15 09 35 4A 9D 42 24 5D 21 47 0F 60 17 69  .@..5J.B$]!G.`.i
0040:  E0 55 22 5B 88 F1 BB B3 48 7F 9F 84 B9 C1 D0 0C  .U"[....H.......
0050:  32 65 62 CF 37 68 F2 E2 A2 84 0D 82 4B D9 5A 94  2eb.7h......K.Z.
0060:  FF 9A 6D 51 48 94 EA EF CB 43 F4 F4 5D 7D 71 0B  ..mQH....C..]}q.
0070:  EA 0B AD 16 41 90 02 D4 C5 B9 87 F3 E1 A1 7C BC  ....A.........|.
0080:  6B 4E 57 36 CD 65 C0 A2 67 09 58 D1 11 6E 4D 98  kNW6.e..g.X..nM.
0090:  77 C6 38 C2 D7 5E 9C 4D 7F 83 E2 60 54 ED D6 1C  w.8..^.M...`T...
00a0:  F5 56 FC 86 06 8A 58 15 C6 15 C1 AE A9 98 4C C8  .V....X.......L.
00b0:  B4 F5 53 F1 B4 B4 BA F3 DD 27 0A 4F 7F B6 38 A6  ..S......'.O..8.
00c0:  99 7F FC 7E 68 69 E8 80 EF B0 A6 BB 94 B1 52 5A  ...~hi........RZ
00d0:  6F 0C 87 98 39 0B C7 8F 45 02 E8 7E 87 D2 CF FF  o...9...E..~....
00e0:  14 8A E6 91 7B 17 C2 2B 4F C3 C2 49 A5 08 7A DB  ....{..+O..I..z.
00f0:  82 F7 49 59 9D AA EB B8 2E 8A D2 04 FB 52 01 70  ..IY.........R.p
0100:  62 8C DD 74                                      b..t

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  17 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B 36 16 E0 29 27 9C 00 83 C6 D9 8A  .....6..)'......
0010:  00                                               .

Response 240 bytes: 61 1A  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 8C 0A C8 A2 27 FD B1 FA  |...........'...
0010:  A9 64 86 1B 13 D2 C2 B2 D8 F3 66 C5 52 3F 39 24  .d........f.R?9$
0020:  FB D0 DB DE 8F 77 BB EF 54 D8 3E 91 76 60 84 20  .....w..T.>.v`. 
0030:  1F 5C 62 6C 09 E5 A4 1B 0C 75 A6 56 87 B5 81 C7  .\bl.....u.V....
0040:  9B DD 9D D2 89 3E 9E AC D6 AF 50 70 1E 4B CA 29  .....>....Pp.K.)
0050:  7E 7B 6A 4B 4F D4 B2 5A 8F F4 76 27 BB AE CE 54  ~{jKO..Z..v'...T
0060:  F0 8E 50 FC D1 E5 FD E9 AA 4C 42 6D CC D8 34 64  ..P......LBm..4d
0070:  C5 20 5F EA 0C A4 2E F0 23 08 51 6A D5 FE 85 B6  . _.....#.Qj....
0080:  52 C3 1F C1 BC C0 D8 93 9E 44 CC 86 54 0F 56 87  R........D..T.V.
0090:  96 EB 92 EE 43 5C AC D7 2B E4 9E F8 C2 60 5C 6F  ....C\..+....`\o
00a0:  67 12 FC AC 54 B1 E0 51 CD ED 2A 42 6F 1C 0A BD  g...T..Q..*Bo...
00b0:  58 CE 46 20 0E 01 4C C3 F5 08 2A 7C 90 05 43 F6  X.F ..L...*|..C.
00c0:  97 52 E1 2C E1 66 4E 21 93 14 1C BE F0 B8 38 57  .R.,.fN!......8W
00d0:  7E 9F EA 84 E3 64 92 18 17 69 8A E1 5B AD 95 63  ~....d...i..[..c
00e0:  ED AD C1 E3 63 2C A4 10 A6 BD 45 6F 14 55 61 1A  ....c,....Eo.Ua.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 1A                                   .....

Response 28 bytes: 90 00  [I] Command successfully executed (OK).
0000:  FE A7 33 51 E2 60 7B 4D 95 EF 8E D0 19 6A 08 32  ..3Q.`{M.....j.2
0010:  A8 50 40 65 1B 3D 60 ED B8 F1 90 00              .P@e.=`.....
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 35  .....|.........5
0010:  18 AC 47 98 8B 72 55 99 8F 32 18 A3 54 4B 59 C6  ..G..rU..2..TKY.
0020:  FC 5C 63 73 79 FB 62 AF F8 CB 5F 08 B3 BA 6C 0C  .\csy.b..._...l.
0030:  81 75 AC 10 15 E9 34 38 EF C9 5B 1C DC 15 8C 4B  .u....48..[....K
0040:  54 CA A4 77 53 5A 8D 9E 7A 7E 7C E4 FE 91 07 50  T..wSZ..z~|....P
0050:  C7 9E 49 96 85 70 51 7E 6D 56 CA 90 D8 19 A0 2D  ..I..pQ~mV.....-
0060:  EC E8 EC 29 A9 33 BA B0 FC 30 3D F5 4E 03 6D E7  ...).3...0=.N.m.
0070:  57 91 BB 4D F1 50 9D CA CE BD 98 5F 04 F8 D2 AB  W..M.P....._....
0080:  19 1D B3 7C AA AE 7B F0 0B DF A6 D8 88 77 9D BE  ...|..{......w..
0090:  92 4E 91 33 69 F8 03 25 3C 2F E4 9E 4B AC F6 5F  .N.3i..%</..K.._
00a0:  4C 2B 82 15 AA 36 47 B9 3D 18 D0 15 2A 7A E7 8B  L+...6G.=...*z..
00b0:  58 35 FC C3 36 3A F2 7F 34 FC 64 EF 65 55 76 BB  X5..6:..4.d.eUv.
00c0:  B1 FE CC 50 8F 02 1B 9E 54 72 D7 46 F0 61 97 58  ...P....Tr.F.a.X
00d0:  E2 09 92 5C 5A E1 AD 38 02 70 19 1B 0C 4D 8E B9  ...\Z..8.p...M..
00e0:  C2 3A 27 C2 25 7A 81 A9 78 F4 24 BE 83 73 47 0B  .:'.%z..x.$..sG.
00f0:  23 59 AE 74 28 88 36 1C 16 0A 1D B2 04 7D 3E 6B  #Y.t(.6......}>k
0100:  4A 17 7B EA                                      J.{.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  17 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B FB 24 5C D7 0E E7 4C E0 0A 80 84  ......$\...L....
0010:  00                                               .

Response 26 bytes: 61 F0  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 00 02 8E 2B 28 F7 BE CA  |..........+(...
0010:  36 F4 4C A9 64 4C 71 C3 61 F0                    6.L.dLq.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 F0                                   .....

Response 242 bytes: 90 00  [I] Command successfully executed (OK).
0000:  35 E6 D9 4E 14 8B 34 8C F3 B3 65 C7 A2 B7 13 2E  5..N..4...e.....
0010:  34 FC D1 AC 4C 3C CC 53 55 65 DB 04 32 45 29 80  4...L<.SUe..2E).
0020:  50 FB 8D 47 4D 6F 99 37 7B F9 DC F9 2F AE 17 49  P..GMo.7{.../..I
0030:  64 60 35 55 CC 43 60 19 B3 7E FC 94 0E 51 EE EA  d`5U.C`..~...Q..
0040:  8F B7 A8 E8 36 08 4F E5 48 A1 DB FF C0 BA 4F BC  ....6.O.H.....O.
0050:  2D 4E 5E A8 12 91 B9 FA 89 35 BF EB 13 AE 1D E2  -N^......5......
0060:  31 AB 4A C9 74 EA CC 66 43 67 5F E4 DC 29 3B A1  1.J.t..fCg_..);.
0070:  51 26 BF E0 52 2D E8 65 BC 10 86 CE 9B F3 22 5A  Q&..R-.e......"Z
0080:  73 CB D6 FB CB 6C D2 52 D7 8F 74 A3 92 90 39 2D  s....l.R..t...9-
0090:  92 E1 D1 38 8F 76 67 89 1C 60 A3 73 7D 0F 15 26  ...8.vg..`.s}..&
00a0:  45 70 4D 55 7F 39 08 3F 38 3F EF 1F 0D 35 15 7C  EpMU.9.?8?...5.|
00b0:  36 C0 96 3B 19 38 B1 77 BA 8D DA 70 20 F1 08 A4  6..;.8.w...p ...
00c0:  D6 2B 93 6E 59 3B 56 F0 2A 70 9E D7 D8 59 F7 74  .+.nY;V.*p...Y.t
00d0:  14 83 0A 2C 02 21 A4 38 0B 6B AC 00 76 65 72 79  ...,.!.8.k..very
00e0:  20 73 65 63 72 65 74 20 74 65 78 74 21 21 21 0A   secret text!!!.
00f0:  90 00                                            ..
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 35  .....|.........5
0010:  18 AC 47 98 8B 72 55 99 8F 32 18 A3 54 4B 59 C6  ..G..rU..2..TKY.
0020:  FC 5C 63 73 79 FB 62 AF F8 CB 5F 08 B3 BA 6C 0C  .\csy.b..._...l.
0030:  81 75 AC 10 15 E9 34 38 EF C9 5B 1C DC 15 8C 4B  .u....48..[....K
0040:  54 CA A4 77 53 5A 8D 9E 7A 7E 7C E4 FE 91 07 50  T..wSZ..z~|....P
0050:  C7 9E 49 96 85 70 51 7E 6D 56 CA 90 D8 19 A0 2D  ..I..pQ~mV.....-
0060:  EC E8 EC 29 A9 33 BA B0 FC 30 3D F5 4E 03 6D E7  ...).3...0=.N.m.
0070:  57 91 BB 4D F1 50 9D CA CE BD 98 5F 04 F8 D2 AB  W..M.P....._....
0080:  19 1D B3 7C AA AE 7B F0 0B DF A6 D8 88 77 9D BE  ...|..{......w..
0090:  92 4E 91 33 69 F8 03 25 3C 2F E4 9E 4B AC F6 5F  .N.3i..%</..K.._
00a0:  4C 2B 82 15 AA 36 47 B9 3D 18 D0 15 2A 7A E7 8B  L+...6G.=...*z..
00b0:  58 35 FC C3 36 3A F2 7F 34 FC 64 EF 65 55 76 BB  X5..6:..4.d.eUv.
00c0:  B1 FE CC 50 8F 02 1B 9E 54 72 D7 46 F0 61 97 58  ...P....Tr.F.a.X
00d0:  E2 09 92 5C 5A E1 AD 38 02 70 19 1B 0C 4D 8E B9  ...\Z..8.p...M..
00e0:  C2 3A 27 C2 25 7A 81 A9 78 F4 24 BE 83 73 47 0B  .:'.%z..x.$..sG.
00f0:  23 59 AE 74 28 88 36 1C 16 0A 1D B2 04 7D 3E 6B  #Y.t(.6......}>k
0100:  4A 17 7B EA                                      J.{.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  17 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B FB 24 5C D7 0E E7 4C E0 0A 80 84  ......$\...L....
0010:  00                                               .

Response 26 bytes: 61 F0  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 00 02 8E 2B 28 F7 BE CA  |..........+(...
0010:  36 F4 4C A9 64 4C 71 C3 61 F0                    6.L.dLq.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 F0                                   .....

Response 242 bytes: 90 00  [I] Command successfully executed (OK).
0000:  35 E6 D9 4E 14 8B 34 8C F3 B3 65 C7 A2 B7 13 2E  5..N..4...e.....
0010:  34 FC D1 AC 4C 3C CC 53 55 65 DB 04 32 45 29 80  4...L<.SUe..2E).
0020:  50 FB 8D 47 4D 6F 99 37 7B F9 DC F9 2F AE 17 49  P..GMo.7{.../..I
0030:  64 60 35 55 CC 43 60 19 B3 7E FC 94 0E 51 EE EA  d`5U.C`..~...Q..
0040:  8F B7 A8 E8 36 08 4F E5 48 A1 DB FF C0 BA 4F BC  ....6.O.H.....O.
0050:  2D 4E 5E A8 12 91 B9 FA 89 35 BF EB 13 AE 1D E2  -N^......5......
0060:  31 AB 4A C9 74 EA CC 66 43 67 5F E4 DC 29 3B A1  1.J.t..fCg_..);.
0070:  51 26 BF E0 52 2D E8 65 BC 10 86 CE 9B F3 22 5A  Q&..R-.e......"Z
0080:  73 CB D6 FB CB 6C D2 52 D7 8F 74 A3 92 90 39 2D  s....l.R..t...9-
0090:  92 E1 D1 38 8F 76 67 89 1C 60 A3 73 7D 0F 15 26  ...8.vg..`.s}..&
00a0:  45 70 4D 55 7F 39 08 3F 38 3F EF 1F 0D 35 15 7C  EpMU.9.?8?...5.|
00b0:  36 C0 96 3B 19 38 B1 77 BA 8D DA 70 20 F1 08 A4  6..;.8.w...p ...
00c0:  D6 2B 93 6E 59 3B 56 F0 2A 70 9E D7 D8 59 F7 74  .+.nY;V.*p...Y.t
00d0:  14 83 0A 2C 02 21 A4 38 0B 6B AC 00 76 65 72 79  ...,.!.8.k..very
00e0:  20 73 65 63 72 65 74 20 74 65 78 74 21 21 21 0A   secret text!!!.
00f0:  90 00                                            ..
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 08                 ..?..\._...

Response 10 bytes: 61 35  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 3B 30 19 D4 E7 39 DA 61 35                    S;0...9.a5

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 02 3D                 ..?..\._..=

Response 63 bytes: 90 00  [I] Command successfully executed (OK).
0000:  53 3B 30 19 D4 E7 39 DA 73 9C ED 39 CE 73 9D 83  S;0...9.s..9.s..
0010:  68 58 21 08 42 10 84 21 38 42 10 C3 F5 34 10 A0  hX!.B..!8B...4..
0020:  5C C6 10 3D B8 86 F2 D5 1F C3 93 D4 F2 23 66 35  \..=.........#f5
0030:  08 32 30 33 30 30 31 30 31 3E 00 FE 00 90 00     .20300101>.....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 05 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 BA 70 82 02 B1 30 82 02 AD 30 82 01 95  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 D9 BC 7A D1 8F AD 52 1C  ..........z...R.
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  16 31 14 30 12 06 03 55 04 03 0C 0B 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 30 1E 17 0D 31 37 30 36 30  o world0...17060
0050:  35 30 39 33 31 32 35 5A 17 0D 31 38 30 36 30 35  5093125Z..180605
0060:  30 39 33 31 32 35 5A 30 16 31 14 30 12 06 03 55  093125Z0.1.0...U
0070:  04 03 0C 0B 68 65 6C 6C 6F 20 77 6F 72 6C 64 30  ....hello world0
0080:  82 01 22 30 0D 06 09 2A 86 48 86 F7 0D 01 01 01  .."0...*.H......
0090:  05 00 03 82 01 0F 00 30 82 01 0A 02 82 01 01 00  .......0........
00a0:  98 45 4D 20 51 B5 3D D5 5B 3C 77 8F 5F DC 76 06  .EM Q.=.[<w._.v.
00b0:  D2 95 EC 31 B5 F1 C5 D3 39 E9 1B AE A1 B9 C3 9C  ...1....9.......
00c0:  6C 45 BB 2A 18 3A F2 C6 B8 2D 49 0E 9C 37 5E 03  lE.*.:...-I..7^.
00d0:  DA 84 0A 40 8D A2 42 C3 88 A1 61 82 F5 5B 89 42  ...@..B...a..[.B
00e0:  A4 47 B8 E2 C2 23 50 42 72 9C 60 70 A7 94 9B 4F  .G...#PBr.`p...O
00f0:  D5 9B 34 6F 56 9E B4 A1 B8 70 0E 68 6E D5 61 FF  ..4oV....p.hn.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C1  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  38 90 6D 74 78 34 81 94 7B 61 0D 6D 10 2A 8B 83  8.mtx4..{a.m.*..
0010:  F9 EF 7A DD 56 A2 9B DC B0 B8 C3 69 26 C7 CC 18  ..z.V......i&...
0020:  38 C3 22 7A 92 52 35 C6 18 4B 0E 75 04 36 E0 B9  8."z.R5..K.u.6..
0030:  8E 3A 42 62 3D B9 7A 7D CD E3 DF C9 2F DE 41 1E  .:Bb=.z}..../.A.
0040:  EA 24 70 76 5A 87 C6 C4 38 57 93 B8 CF A8 E0 1B  .$pvZ...8W......
0050:  CB 70 C1 38 14 41 F1 96 08 A5 FD A9 06 09 00 20  .p.8.A......... 
0060:  6B 9A 3F F9 14 69 97 B3 25 14 1B F8 F1 DE 0D EA  k.?..i..%.......
0070:  7D 5E 0B C4 20 DB 5F 9E 38 90 D4 43 01 37 47 98  }^.. ._.8..C.7G.
0080:  27 95 33 FA 03 BC 52 CC BD 3D 5D 3B 3C AA 26 B5  '.3...R..=];<.&.
0090:  2C AF 76 BF E4 46 3D D2 BB E3 13 39 DB 01 95 9A  ,.v..F=....9....
00a0:  A3 CF 02 03 01 00 01 30 0D 06 09 2A 86 48 86 F7  .......0...*.H..
00b0:  0D 01 01 0B 05 00 03 82 01 01 00 85 74 0C 1C E1  ............t...
00c0:  17 C0 44 14 38 61 9C 10 DA 7C 49 B9 4A F8 E6 3D  ..D.8a...|I.J..=
00d0:  3F 95 23 D2 10 27 88 97 1B 95 A0 BC 39 99 3B 27  ?.#..'......9.;'
00e0:  8C 6E 80 9A 0B E2 3B 93 89 02 E7 47 59 F7 54 A7  .n....;....GY.T.
00f0:  2E 8B 6B 53 AD B4 C4 D8 F4 0B 4D 92 B1 4A 5F 61  ..kS......M..J_a
0100:  C1                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C1                                   .....

Response 195 bytes: 90 00  [I] Command successfully executed (OK).
0000:  E8 41 1D 3A E1 F1 21 EF 88 08 B6 31 06 D9 A5 B8  .A.:..!....1....
0010:  A0 9E 4A 8C F3 97 DD 19 30 BE D1 9B 1B 75 11 EC  ..J.....0....u..
0020:  1C B9 E4 E8 C8 B4 E6 54 43 71 50 0F 4B AB 61 15  .......TCqP.K.a.
0030:  AE B1 A2 14 C0 A6 F6 C8 A7 5B 2C 88 25 B0 4E 65  .........[,.%.Ne
0040:  FF 63 A6 4B D6 06 65 69 15 AC 34 2B 2A D1 D0 F2  .c.K..ei..4+*...
0050:  EB BE 58 EA 16 AD 06 70 BC 6B 3F 78 01 BE 4A 02  ..X....p.k?x..J.
0060:  A9 01 EC B7 3D 97 03 14 FF 31 8C 64 11 87 7B C1  ....=....1.d..{.
0070:  30 71 DB 5D FF 46 A3 02 A6 6B F9 D1 83 F0 37 BC  0q.].F...k....7.
0080:  9B D4 13 C6 06 56 A7 76 D2 37 5A AA BD 56 76 F3  .....V.v.7Z..Vv.
0090:  1D 2F CC D4 13 11 AB 6F 2F 36 B6 22 9A 1A A7 7C  ./.....o/6."...|
00a0:  7F F8 95 5C 8C 0E CA 91 FE DA 7D E2 F7 8F 75 7A  ...\......}...uz
00b0:  6E D5 26 B4 BD DE CA C9 DB 27 9B EB 71 01 00 FE  n.&......'..q...
00c0:  00 90 00                                         ...

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0A 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 08                 ..?..\._...

Response 10 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 61 FF                    S...p...a.

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0B 00                 ..?..\._...

Response 256 bytes: 61 FF  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  53 82 02 C0 70 82 02 B7 30 82 02 B3 30 82 01 9B  S...p...0...0...
0010:  A0 03 02 01 02 02 09 00 F5 AD 37 06 9A 5B AE 12  ..........7..[..
0020:  30 0D 06 09 2A 86 48 86 F7 0D 01 01 0B 05 00 30  0...*.H........0
0030:  19 31 17 30 15 06 03 55 04 03 0C 0E 68 65 6C 6C  .1.0...U....hell
0040:  6F 20 77 6F 72 6C 64 20 39 64 30 1E 17 0D 31 37  o world 9d0...17
0050:  30 36 30 35 30 39 33 36 31 30 5A 17 0D 31 38 30  0605093610Z..180
0060:  36 30 35 30 39 33 36 31 30 5A 30 19 31 17 30 15  605093610Z0.1.0.
0070:  06 03 55 04 03 0C 0E 68 65 6C 6C 6F 20 77 6F 72  ..U....hello wor
0080:  6C 64 20 39 64 30 82 01 22 30 0D 06 09 2A 86 48  ld 9d0.."0...*.H
0090:  86 F7 0D 01 01 01 05 00 03 82 01 0F 00 30 82 01  .............0..
00a0:  0A 02 82 01 01 00 98 65 61 0B 97 69 A9 02 75 EE  .......ea..i..u.
00b0:  1F F7 89 3E 73 AF 56 33 81 9B 09 4A ED E6 17 20  ...>s.V3...J... 
00c0:  CF 9F FB EB 05 CC DB 8C 71 B3 B3 A0 E5 E4 6F 5D  ........q.....o]
00d0:  9C 18 E8 5A B8 B3 05 8C 58 14 52 CE 37 1C 54 BA  ...Z....X.R.7.T.
00e0:  B9 53 06 C4 1D 86 B9 3A 2A E9 98 4C 55 D6 8C 98  .S.....:*..LU...
00f0:  98 02 96 D5 66 5A DA C5 7E BF 4A AE 49 AC 61 FF  ....fZ..~.J.I.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 FF                                   .....

Response 257 bytes: 61 C7  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  B3 AB 9C ED E7 E9 65 0F F1 54 CD 89 14 B1 46 0A  ......e..T....F.
0010:  A0 30 12 47 3D A0 7F 41 75 6C 07 67 22 EB EE 17  .0.G=..Aul.g"...
0020:  15 D8 28 59 A7 E1 C3 F9 A5 F9 E2 4E 6A 64 79 BD  ..(Y.......Njdy.
0030:  59 2F 78 6A 22 65 C0 64 02 D4 6E 5B 9D C9 84 A6  Y/xj"e.d..n[....
0040:  79 F6 EA 42 2A 89 2A E3 31 65 FE 2B 12 EC 23 0D  y..B*.*.1e.+..#.
0050:  89 61 10 3C C6 64 02 94 55 CF AE BC 9C 61 80 58  .a.<.d..U....a.X
0060:  FE 23 EC 0C 00 53 67 20 B5 79 BA 91 85 71 44 B9  .#...Sg .y...qD.
0070:  E4 0C 39 AF D4 B4 8F 38 DD 13 A4 48 59 26 B3 6A  ..9....8...HY&.j
0080:  86 22 19 46 38 85 12 53 D0 7A 23 F8 66 DC FB B5  .".F8..S.z#.f...
0090:  BB 79 4F CB 98 95 B8 B8 C3 9E EB 86 B1 25 D0 0B  .yO..........%..
00a0:  1C 8E 6E C4 AA A9 97 55 02 03 01 00 01 30 0D 06  ..n....U.....0..
00b0:  09 2A 86 48 86 F7 0D 01 01 0B 05 00 03 82 01 01  .*.H............
00c0:  00 33 E3 DF 87 83 B6 B0 A5 76 77 01 E7 71 F1 AE  .3.......vw..q..
00d0:  94 2C 55 F9 B6 81 23 64 5F F8 A0 35 C0 FE 30 75  .,U...#d_..5..0u
00e0:  63 9C D5 8C 6F B7 DB 9B 73 0E 10 66 A2 B5 F8 EC  c...o...s..f....
00f0:  1C D9 C0 99 64 65 75 51 0D C6 57 DC 27 8E 85 61  ....deuQ..W.'..a
0100:  C7                                               .

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 C7                                   .....

Response 201 bytes: 90 00  [I] Command successfully executed (OK).
0000:  34 BF B3 CD FA A1 F4 20 65 C9 D8 E6 0A 97 C1 13  4...... e.......
0010:  4C 61 BE 5E 9D 3B CB 11 CA 3E 0F 8F CE A6 73 58  La.^.;...>....sX
0020:  34 93 FB 1D 42 D7 C2 89 86 43 F5 69 3C 0B 99 5A  4...B....C.i<..Z
0030:  2F FE 3F 4A AD 45 1F 55 2B 8C 84 08 F2 A1 20 7C  /.?J.E.U+..... |
0040:  BD B2 E7 47 8F FA C0 DC 80 BB 52 BE 98 55 2B 2C  ...G......R..U+,
0050:  95 60 A9 F6 B4 76 61 7E 80 0A AE 85 BE 19 E3 14  .`...va~........
0060:  E2 A6 B5 EC 54 45 70 57 95 33 87 22 24 4F 9C 9E  ....TEpW.3."$O..
0070:  AB AD 46 80 1A 2A 9D 16 55 B8 DA 46 B9 CB D8 EA  ..F..*..U..F....
0080:  4F 26 36 E2 85 DF C3 95 A9 89 5E 07 5F 3E 53 30  O&6.......^._>S0
0090:  DF AD 19 56 58 CA 27 89 E9 D4 F0 E2 0E A4 19 2D  ...VX.'........-
00a0:  17 5B 9D CE E4 60 1A 04 C1 E0 1A FC FD 48 D4 94  .[...`.......H..
00b0:  C3 98 6A 53 1A BC 4E 5F 91 D8 B8 E4 45 97 75 91  ..jS..N_....E.u.
00c0:  32 DD 71 01 00 FE 00 90 00                       2.q......

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 01 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  13 bytes: 20     VERIFY     Verify the transferred data (such as a PIN).
0000:  00 20 00 80 08 31 32 33 34 35 36 FF FF           . ...123456..

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  260 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  10 87 07 9A FF 7C 82 01 06 82 00 81 82 01 00 35  .....|.........5
0010:  18 AC 47 98 8B 72 55 99 8F 32 18 A3 54 4B 59 C6  ..G..rU..2..TKY.
0020:  FC 5C 63 73 79 FB 62 AF F8 CB 5F 08 B3 BA 6C 0C  .\csy.b..._...l.
0030:  81 75 AC 10 15 E9 34 38 EF C9 5B 1C DC 15 8C 4B  .u....48..[....K
0040:  54 CA A4 77 53 5A 8D 9E 7A 7E 7C E4 FE 91 07 50  T..wSZ..z~|....P
0050:  C7 9E 49 96 85 70 51 7E 6D 56 CA 90 D8 19 A0 2D  ..I..pQ~mV.....-
0060:  EC E8 EC 29 A9 33 BA B0 FC 30 3D F5 4E 03 6D E7  ...).3...0=.N.m.
0070:  57 91 BB 4D F1 50 9D CA CE BD 98 5F 04 F8 D2 AB  W..M.P....._....
0080:  19 1D B3 7C AA AE 7B F0 0B DF A6 D8 88 77 9D BE  ...|..{......w..
0090:  92 4E 91 33 69 F8 03 25 3C 2F E4 9E 4B AC F6 5F  .N.3i..%</..K.._
00a0:  4C 2B 82 15 AA 36 47 B9 3D 18 D0 15 2A 7A E7 8B  L+...6G.=...*z..
00b0:  58 35 FC C3 36 3A F2 7F 34 FC 64 EF 65 55 76 BB  X5..6:..4.d.eUv.
00c0:  B1 FE CC 50 8F 02 1B 9E 54 72 D7 46 F0 61 97 58  ...P....Tr.F.a.X
00d0:  E2 09 92 5C 5A E1 AD 38 02 70 19 1B 0C 4D 8E B9  ...\Z..8.p...M..
00e0:  C2 3A 27 C2 25 7A 81 A9 78 F4 24 BE 83 73 47 0B  .:'.%z..x.$..sG.
00f0:  23 59 AE 74 28 88 36 1C 16 0A 1D B2 04 7D 3E 6B  #Y.t(.6......}>k
0100:  4A 17 7B EA                                      J.{.

Response  2 bytes: 90 00  [I] Command successfully executed (OK).
0000:  90 00                                            ..

Command  17 bytes: 87     GENERAL AUTHENTICATE The General Authenticate command is used to generate secure messaging session keys between both entities (IFD and ICC) as part of elliptic curve asymmetric key mutual authentication.
0000:  00 87 07 9A 0B FB 24 5C D7 0E E7 4C E0 0A 80 84  ......$\...L....
0010:  00                                               .

Response 26 bytes: 61 F0  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7C 82 01 04 82 82 01 00 00 02 8E 2B 28 F7 BE CA  |..........+(...
0010:  36 F4 4C A9 64 4C 71 C3 61 F0                    6.L.dLq.a.

Command   5 bytes: C0     GET RESPONSE Retrieves the response from a previous command.
0000:  00 C0 00 00 F0                                   .....

Response 242 bytes: 90 00  [I] Command successfully executed (OK).
0000:  35 E6 D9 4E 14 8B 34 8C F3 B3 65 C7 A2 B7 13 2E  5..N..4...e.....
0010:  34 FC D1 AC 4C 3C CC 53 55 65 DB 04 32 45 29 80  4...L<.SUe..2E).
0020:  50 FB 8D 47 4D 6F 99 37 7B F9 DC F9 2F AE 17 49  P..GMo.7{.../..I
0030:  64 60 35 55 CC 43 60 19 B3 7E FC 94 0E 51 EE EA  d`5U.C`..~...Q..
0040:  8F B7 A8 E8 36 08 4F E5 48 A1 DB FF C0 BA 4F BC  ....6.O.H.....O.
0050:  2D 4E 5E A8 12 91 B9 FA 89 35 BF EB 13 AE 1D E2  -N^......5......
0060:  31 AB 4A C9 74 EA CC 66 43 67 5F E4 DC 29 3B A1  1.J.t..fCg_..);.
0070:  51 26 BF E0 52 2D E8 65 BC 10 86 CE 9B F3 22 5A  Q&..R-.e......"Z
0080:  73 CB D6 FB CB 6C D2 52 D7 8F 74 A3 92 90 39 2D  s....l.R..t...9-
0090:  92 E1 D1 38 8F 76 67 89 1C 60 A3 73 7D 0F 15 26  ...8.vg..`.s}..&
00a0:  45 70 4D 55 7F 39 08 3F 38 3F EF 1F 0D 35 15 7C  EpMU.9.?8?...5.|
00b0:  36 C0 96 3B 19 38 B1 77 BA 8D DA 70 20 F1 08 A4  6..;.8.w...p ...
00c0:  D6 2B 93 6E 59 3B 56 F0 2A 70 9E D7 D8 59 F7 74  .+.nY;V.*p...Y.t
00d0:  14 83 0A 2C 02 21 A4 38 0B 6B AC 00 76 65 72 79  ...,.!.8.k..very
00e0:  20 73 65 63 72 65 74 20 74 65 78 74 21 21 21 0A   secret text!!!.
00f0:  90 00                                            ..
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...
Reset
Power Down
Power Up

Command  20 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 0F D2 33 00 00 00 45 73 74 45 49 44  ......3...EstEID
0010:  20 76 33 35                                       v35

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   5 bytes: CA     GET DATA   Read TLV-coded data objects.
0000:  00 CA DF 30 05                                   ...0.

Response  2 bytes: 6D 00  [E] Instruction code not supported or invalid
0000:  6D 00                                            m.

Command  11 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 06 A0 00 00 00 01 01                 ...........

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  15 bytes: A4     SELECT     Select a file.
0000:  00 A4 04 00 09 A0 00 00 03 08 00 00 10 00 00     ...............

Response 21 bytes: 90 00  [I] Command successfully executed (OK).
0000:  61 11 4F 06 00 00 10 00 01 00 79 07 4F 05 A0 00  a.O.......y.O...
0010:  00 03 08 90 00                                   .....

Command  11 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 05 5C 03 5F C1 0C 08                 ..?..\._...

Response  2 bytes: 6A 82  [E] File not found
0000:  6A 82                                            j.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 08                       ..?..\.~.

Response 10 bytes: 61 0C  [I] Command successfully executed; \XX\ bytes of data are available and can be requested using GET RESPONSE.
0000:  7E 12 4F 0B A0 00 00 03 61 0C                    ~.O.....a.

Command   9 bytes: CB     GET DATA   x
0000:  00 CB 3F FF 03 5C 01 7E 14                       ..?..\.~.

Response 22 bytes: 90 00  [I] Command successfully executed (OK).
0000:  7E 12 4F 0B A0 00 00 03 08 00 00 10 00 01 00 5F  ~.O............_
0010:  2F 02 40 00 90 00                                /.@...
Reset
Power Down
